{"instrument":"PART: INSTRUMENT\n\nInstruments measure specific data points which can be read. Adjust the Instrument mode\nwith the Hammer's Config Tool. When signaled, they will output their reading through\nMode 3 Polysilicon.\n\nLIST OF MODES\n\n1: Speed. Velocity of the Instrument.\n\n2: Meter. Can be connected to pipes or wires to display the substance and amount contained\nwithin Containers or energy cells.\n\n3: Position relative to Earth's center at sea level. Displayed in list form (X;Y;Z).\n\n4: GUI. Attaching it to another part for a few seconds will link the part to the Instrument,\n\nand attempt to display what is shown on that part's SurfaceGui.\n\n5: Weight. Shows total weight of all directly or indirectly connected parts, unless connected\nto terrain, in which case it will show the weight of all parts within 100 studs.\n\n6: Rotational speed.\n\n7: Odometer. Displays the number of studs traveled since set to this mode.\n\n8: Usage. Similar to mode 2, but instead shows the approximate change per second. Note that\nvalues shown will not be 100% accurate.\n\n9. Age. Shows the exact seconds since the instrument was created or last adjusted. This value\nwill save across servers.\n\n10: Part Count. Shows amount of all directly or indirectly connected parts, unless connected\nto terrain, in which case it will count all parts within 100 studs.\n\nUses: Measurements\nRequires: Glass, Copper\nMalleability: Fair\n","teleporter":"PART: TELEPORTER\n\nTeleporters are able to quickly transport players unlimited distances.\n\nThe Teleporter's ID is set with the Hammer's Config Tool; set two Teleporters to the\nsame ID to use. A Teleporter can remain connected to another even if the other\nTeleporter's ID is changed.\n\nTo use, step onto the Teleporter and wait about 10 seconds. Energy is drained from\nboth the sending and recieving Teleporter; however, power to the recieving Teleporter\nis not required.\n\nUses: Player Transportation\n\nRequires: Abantium, Gold, Quartz, Ruby, Silicon, Diamond\nMalleability: none\n\nPower Usage: 62 per warp\n","goo":"PART: GOO\n\nGoo is a sticky part which welds itself to items that touch it, similar to how arrows\nstick into parts. Goo is only sticky if already connected to at least two parts, and\nreleases what it is stuck to when signaled.\n\nUse the Hammer's Adjust tool to set options:\n\n0 = Sticks to parts and terrain.\n\n1 = Does not stick to terrain (default).\n\n2 = Does not stick to parts locked by the same player who locked the Goo.\n3 = Both 1 and 2.\n\n[item] = Enter a part name for the Goo to stick only to parts of that type.\n\nGoo cannot stick to transparent parts such as Glass.\nUses: Cranes, Cargo, Traps\n\nRequires: Ice, Oil, Ashes, Sand\nMalleability: Good\n","dynamite":"PART: DYNAMITE\n\nDynamite is a special type of explosive that gets more powerful as more are attached to\neach other. It is activated by signaling, or setting on fire.\n\nUses: Weapons, Traps, Self-Destructs\nRequires: Charcoal, Wood, Leaves, Oil\nMalleability:\n","heater":"PART: HEATER\n\nA Heater will glow and warm nearby players when powered. It has higher effective radius the\nlarger it is resized.\n\nUses: Heating\n\nRequires: Copper\n\nMalleability: Poor\n\nPower Usage: 1 energy/second\n","copper":"PART: COPPER\n\nCopper is an orange metal acquired from Copper Ore. It has low strength, and somewhat\nlow weight.\n\nUses: Crude Armor\nObtained: Mining, sometimes contained in mountains, caves, and rock formations.\n\nMalleability: Good\n","bogie":"PART: BOGIE\n\nA Bogie is a metal wheelset for trains. When placed above Track, they will align themselves onto\nthe rails and follow the Track. Only ONE bogie should be used for each seperate engine or car.\n\nBogies will couple when a powered/coupled Bogie touches one that is not. Signal to decouple.\nCoupled Bogies MUST face the same direction.\n\nUnlike DriveBoxes and Treads, Bogies are linked to engines/motors by attaching them (not with the\nhinge) instead of a Rod Constraint. When attached, the engine/motor will provide motion while\nrunning. Using the Hammer's Adjust tool can reverse the Bogie.\n\nUses: Trains, Rollercoasters, Elevators\nRequires: lron, Copper, Quartz\nMalleability: Fair\n","arcolantium":"PART: ARCOLANTIUM\nA heavy, nearly indestructable material that cannot be duplicated.\nDissolves on contact with ProtaliumOxide.\nUses: Armor, Construction\n\nRequires: Copper, ProtaliumOxide, Protalium, Lirvanite, Uranium\nMalleability: Fair\n","missile":"PART: MISSILE\n\nA Missile is a small rocket motor that is one-use, but requires no additional fuel.\nMissiles cannot be safely ridden by a player, and cannot travel from Earth to space by\nthemselves (though they function in both places).\n\nSignal the Missile to light it. They are best signaled with red SignalWires to launch\nthem, since red SignalWires despawn when activated. The length of time the Missile flies\nis determined by the length. After it burns out, it will eventually despawn.\n\nIn addition to providing propulsion, Missiles will also power connected items while\nin-flight. This can be useful to power Seekers, for seeking missiles. Missiles do not\nfunction for a limited time after another missile on the same machine is activated.\n\nUses: Weapon\nRequires: Titanium, Charcoal, Sulfur, Ashes\nMalleability: Fair\n","shuriken":"TOOL: SHURIKEN\n\nShurikens are small blades that can hit multiple enemies at once. They require skill\nto use, as Shurikens will curve towards the direction the thrower is facing.\n\nShuriken Ammunitions (load an ammo by using the Ammo button in Produce GUI):\n-Default: Standard shurikens.\n\n-PowerCell: Confusion shurikens that interfere with the movement of the hit player.\n-Protalium: Spectral shurikens that phase through walls and can kill a player in one hit.\nUses: Weapon\n\nRequires: Iron, Ruby, Quartz\n\nRange: Short\n\nDamage: Medium\nFiring Rate: Fast\n","wood":"PART: WOOD\n\nWood is a light, malleable, and cheap material obtained from trees. The main downside\nof Wood as a building material is the fact that it is flammable.\n\nFor use in a campfire, Wood should be made into Firewood, as it burns longer.\nUses: Construction, Vehicles, Aircraft, Seacraft\n\nObtained: Harvesting trees\nMalleability: Good\n","servo":"PART: SERVO\n\nServos are special electric motors that can be set to attain specific angles. They are controlled\neither by attached PolySilicon or direct signaling data.\n\nPolysilicon Mode 0: Increase Angle\nPolysilicon Mode 1: Decrease Angle\nPolysilicon Mode 2: Reset Angle\n\nThe increment that the angle is increased or decreased is determined by the Polysilicon's total\nvolume in studs. Each stud of volume decreases the increment, making smaller amounts of\nPolysilicon turn the Servo faster, and vice versa.\n\nUses: Machines\n\nRequires: Copper, Iron, Silicon, Magnesium\nMalleability: Fair\n\nPower Usage: 2.72 energy/second\n","energycannon":"PART: ENERGYCANNON\n\nEnergyCannons fire charged projectiles in a fashion similar to the Cannon. They are\nextremely customizable, with five different ammunition slots that contribute to the\nproperties of the weapon, giving 42236 possible EnergyCannon types. Insert a part\ninto the EnergyCannon for each slot. EnergyCannons must be powered to fire.\n\nPOSSIBLE AMMO FOR EACH SLOT\n\nItems are in order of their ID number seen when hovered over with Drag tool. For example,\nEnergyCannon (1x0x0x0x0) would have Eridanium in the first slot.\n\nSlot 1 (projectile type): none, Eridanium, BeamCannon, Neodymium, Abantium, Lirvanite\n\nSlot 2 (strength/weakness vs. certain object types): none, Lirvanite, LightningRod,\nAbantium, Protalium, Eridanium, ExoticMatter\n\nSlot 3 (boosts a weapon stat): none, Zaktralia, GammaDrive, LiquidNitrogen, GravDevice,\nProtalium, Uranium\n\nSlots 4 and 5 (special abilities): none, Goo, Abantium, Jade, Lirvanite, Protalium,\nProtaliumOxide, Eridanium, Sulfur, Nitroglycerin, Zaktralia, lonDrive\n\nPROJECTILE TYPE\n\n0. [none]: Ball lightning with a quick rate of fire.\n\n1. [Eridanium]: Fast-moving plasma fireball.\n\n2. [BeamCannon]: Invisible tracefire ray, not compatible with \"Projectile\" effects.\n3. [Neodymium]: Explosive star bomb.\n\n4. [Abantium]: Energy pulse which has increased damage, but dissipates the further it travels.\n5. [Lirvanite]: Vortex wave with a huge area of effect.\n\nBASIC DAMAGE ABILITY\n\n0. [none]: Best vs. players or bots.\n\n1. [Lirvanite]: Best vs. strong parts (Eridanium, Lirvanite, etc).\n\n2. [LightningRod]: Best vs. weak parts (Wood, Aluminium, etc).\n\n3. [Abantium]: Best vs. any part, but less overall.\n\n4. [Protalium]: Best vs. energy shields.\n\n5. [Eridanium]: Best vs. medium-strength parts (Iron, Titanium, etc).\n\n6. [ExoticMatter]: Chaos projectile which splits on impact, but massive power usage.\nSTAT BOOST\n\n0. [none]\n\n1. [Zaktralia]: Damage increase.\n\n2. [GammaDrive]: Fire rate increase.\n\n3. [LiquidNitrogen]: Range increase.\n\n4, [GravDevice]: Projectile speed increase.\n\n5. [Protalium]: Power usage is greatly reduced.\n\n6. [Uranium]: All stats increased a mediocre amount.\n\nEFFECTS (SLOTS 4AND 5)\n\n0. [none]: No effect.\n\n1. [Goo]: Splashes permanent residue of the projectiles color.\n\n2. [Abantium]: Energy shockwave which conducts through metal and fries electronics.\n3. [Jade]: Projectile can phase through the first layer of armor.\n\n4, [Lirvanite]: Projectile absorbs other projectiles and massively gains strength.\n5. [Protalium]: Shattering shockwave that can break multiple parts at once.\n\n6. [ProtaliumOxide]: Explodes on impact. Increases explosion power for Bombs.\n7. [Eridanium]: Disrupts cloaks, and deals more damage to energy shields.\n\n8. [Sulfur]: Corrosive acid splash that eats away at corrodable materials.\n\n9. [Nitroglycerin]: Inferno splash which sets parts on fire.\n\n10. [Zaktralia]: Projectile locks on and seeks what the weapon is pointing at.\n\n11. [lonDrive]: Concussion force which repulses the target backwards.\n\nUses: Weapon\n\nRequires: Eridanium, Copper, Titanium, Gold, Jade, Aluminium, Diamond\nMalleability: Fair\n\nPower Usage: 6.66 energy/second (0.83 energy/second with power saving option)\n","aethergate":"PART: AETHERGATE\n\nAn AetherGate part itself functions only as the \"core\" of a true AetherGate; you must\nuse four Nodes to build a working one. Power with a PowerCell and signal to activate.\nNOTE: AetherGates are unable to use ProtonCells to run in this mode.\n\nTo use an AetherGate, connect it with a time machine to create a time portal generator.\nItems sent into a time portal will be sent to the year the TimeMachine is set to (must\nbe 25 years ahead of the current year or fewer).\n\nUses: Future Time Travel\n\nRequires: Lirvanite, Abantium, Eridanium, Jade, Silicon, Uranium, Gas, ExoticMatter\nMalleability: none\n\nPower Usage: ???\n","gold":"PART: GOLD\n\nGold is the third heaviest material, and also very malleable. For these reasons,\nit is a good material to use in counterweights.\n\nUses: Counterweights, Currency\nObtained: Mining, sometimes contained in mountains, caves, and rock formations.\n\nMalleability: Extreme\n","node":"PART: NODE\nNodes are components used to build AetherGates.\nUses: AetherGate Construction\n\nRequires: Eridanium, Gold, PhotonShard\nMalleability: none\n","converter":"PART: CONVERTER\n\nConverters are used to make copies of buildings and other structures for stacking or\nplacement elsewhere. To use, place the Converter near an unlocked structure, and use\n\nthe Hammer's Config tool to set the Save value to 1. Within 100 studs, structure parts\n\nwill be saved into the Converter. Vehicles and other complex machines cannot be saved;\nonly basic structure parts (such as Wood, Abantium, Glass, etc) and some simple electronic\nparts will be detected.\n\nAfter saving a structure, it may be reloaded using credits. Click on the Converter to insert\ncredits for the cost of the structure, and the copied structure will be generated relative\n\nto the Converter's position once the required amount is filled. An additional 20% fee applies\nto the credit price. The structure that is loaded will be stacked on top of any obstacles\n\nin the way, making it possible to create skyscrapers by stacking the same room.\n\nConverters cannot save more than 50 parts at a time, and the structure data is not saved\nbetween servers. If locked, only the player who locked will be able to insert credits.\n\nConverted parts are unable to be used in manufacturing or other processes.\nUses: Construction\n\nRequires: Iron, Silicon, Quartz, Titanium\nMalleability: none\n","energybomb":"PART: ENERGYBOMB\n\nEnergyBombs are bombs that release shockwaves of charged particles when signaled. The\nshockwaves are highly powerful and instantly incinerate most materials.\n\nEnergyBomb shockwaves cannot travel through parts. Make sure there is a clear, open\npath between the bomb and the target when used.\n\nUses: Weapons\nRequires: Uranium, Titanium, Aluminium, Gold, Ruby\nMalleability: none\n","firebox":"PART: FIREBOX\n\nA Firebox is a small combustion chamber in which any burnable material can be inserted\nand burned. When burning in a Firebox, materials burn slightly faster, but there is no\ndanger of fire spreading, and any material inserted is automatically lit.\n\nThe contents of a Firebox may burn for up to 15 minutes, depending on what and how much\nwas inserted into it. The slats at the bottom will glow a dimmer red as the fire dies\ndown.\n\nUses: Boilers, Heat, Light, Garbage Disposal\nRequires: Iron, Quartz, Stone, Flint\nMalleability: none\n","cotton":"PART: COTTON\nCotton is a very light substance found by harvesting Cotton plants.\nUses: Manufacturing\n\nObtained: Harvesting Cotton plants\nMalleability: none\n","horse":"OBJECT: HORSE\n\nHorses toggle between forward movement and calm roaming when clicked. Attach a SteeringSeat\nto ride the Horse, or use other kinds of attachments to make them carry cargo or pull loads.\n\nThey must be fed Leaves every so often to stay alive, and will neigh while hurt or hungry.\nTouch Leaves to the Horse to do this. Each meal heals the Horse to full health.\n\nTouch a Horse with your character to calm it and make it hold still for a while. This only\nhas an effect while roaming.\n\nUses: Pets, Transport\nRequires: Leaves, Quartz\nMalleability: none\nHunger: 25 min\n","alkalinecell":"PART: ALKALINECELL\nThe AlkalineCell is a small energy cell that is pre-charged, but cannot be recharged.\n\nIt has 500 initial power, and is very small (1x2x‘1), so it is portable and can be used\nin machines where low weight is needed. Unlike most other parts, AlkalineCells have\nlittle resale value.\n\nUses: Portable Power Source\n\nRequires: Copper, Ashes, Ice, Magnesium, Jade\nMalleability: none\n\nPower Capacity: 500\n","gunpowder":"PART: GUNPOWDER\n\nGunpowder is a weak explosive that detonates from nearby heat sources.\nIt is not powerful enough to cause a decent amount of damage, and is more useful for\nmanufacturing other items, such as tool weapons.\n\nUses: Firecrackers, Manufacturing\nRequires: Charcoal, Sulfur, Ashes\nMalleability: none\n","protaliumoxide":"SUBSTANCE: PROTALIUMOXIDE\n\nProtaliumOxide is a glowing liquid derived from Protalium. Containers of ProtaliumOxide provide\nenormous amounts of energy to connected PowerCells.\n\nContact with ProtaliumOxide is one of the few methods of destroying Arcolantium.\nIf ProtaliumOxide touches LiquidNitrogen, an explosive reaction occurs producing ExoticMatter.\n\nAs a liquid substance, ProtaliumOxide evaporates unless kept in a Container, and can be\ntransferred through Pipes, Controllers, Valves, Fuel Cans, and Faucets.\n\nUses: ExoticMatter Production, Weapon\nRequires: lron, Leaves, Protalium, Gold, Uranium\nMalleability: none\n","water":"SUBSTANCE: WATER\n\nWater puts out fires on contact and can be boiled into Steam when in a Container heated by\na Firebox, Reactor, or burning materials. Water also cools Reactors when poured on top.\n\nWhen a Container of Water is exposed to Firebox smoke, Acid condenses in a second, empty Contai\nattached to the Water Container.\n\nAs a liquid substance, Water evaporates unless kept in a Container, and can be transferred\nthrough Pipes, Controllers, Valves, Fuel Cans, and Faucets.\n\nUses: Firefighting, Reactor Coolant, Steam Production, Acid Production\nObtained: Setting Containers in the ocean, Derrick drilling, melting Ice, condensing Steam\nMalleability: none\n","warpgate":"OBJECT: WARPGATE\nA WarpGate is a wormhole generator that can transport objects infinite distances.\n\nSelf-powered WarpGates are found on most other planets; a player-created one must be\npowered by a power source connected to the left side. Click or signal the WarpGate's\nbuttons to dial to another gate. After dialing the 6 numbers, it may do one of the\nfollowing actions indicating the dial status:\n\n-No response: Gate either fried or not powered.\n-Shutdown: Connection failed - Gate not found.\n-Shutdown with yellow lights: Gate busy.\n\n-Shutdown with red flashing lights: Severe wormhole fault.\n-Startup with yellow lights: Incoming connection.\n\n-Startup with green lights: Connection successful.\n\nA large enough object inside of the gate's ring will block objects incoming and cause\nthem to be vaporized, however, the gate will also vaporize anything (except terrain)\ninside the ring during startup.\n\nPowered WarpGates constantly drain energy even when not in use, and use more while\ndialing or creating a wormhole, but do not require energy to maintain a wormhole.\n\nUses: Large-scale Teleportation\nRequires: Ruby, Titanium, Uranium, Silicon, ExoticMatter, Gold, Aluminium\nPower Usage: Variable\n","biowall":"PART: BioWall\n\nBioWall is a living plant-based substance which takes gradual damage similar to Sails or\nHulls, but regenerates health over time. Though flammable, its damage-absorbing properties\ncan make it effective used as armor against certain kinds of attacks. Plants can also grow\n\non it like OrganicMatter.\n\nBioWall heals at a very fast rate in the humidity during rainstorms (not snow/dust storms).\nUses: Camoflauge, Construction, Vehicles, Aircraft, Seacraft\n\nRequires: OrganicMatter, Sulfur, Ashes\nMalleability: Good\n","steeringseat":"PART: STEERINGSEAT\n\nThe SteeringSeat is a special type of Seat that allows steering control of vehicles.\n\nIt has a steering speed setting, as well as modes set by the Hammer's Config Tool:\n\n-0: Normal. Rotates left/right, force decreases if turning speed is increased.\n\n-1: Rotation. Rotates left/right, and can pitch up/down. Used for more complex vehicles,\nsuch as aircraft and spacecraft.\n\n-2: Mouse. Rotates according to mouse position, when left mouse button is held down\n(and no tools selected).\n\nMode 0 SteeringSeats can be rod-linked to DriveBoxes, or attached to Bogies/Generators for\nmanual pedaling (use Up/Down or W/S).\n\nHolding Shift while on Mode 1 slows the movement down 4x, allowing precision aim.\n\nThe SteeringSeat is controlled by the arrow keys or WASD for the first two modes.\nIt can also be remotely controlled with a RemoteSeat.\n\nUses: Vehicles, Aircraft, Seacraft, Spacecraft\nRequires: Wood\nMalleability: none\n","flubber":"PART: FLUBBER\n\nFlubber is a resizable substance with very high restitution and low friction.\nCan be made into Templates.\n\nUses: Chaos, Fire Spreading\n\nRequires: Oil, Ice, Leaves, LiquidNitrogen\nMalleability: Fair\n","book":"PART: BOOK\n\nBooks allow large amounts of text (up to 500 characters per book) to be written down\nand saved. In addition, RichText markup tags may be used to modify the wording, and\nup to three images may be included in the book. To edit an image, click on it, type\n\nan asset ID in the number bar that appears (the number portion only) and click the image\nagain. The cover title of the Book will be determined by the first line (or word) of\n\ntext. Locked Books cannot be overwritten by other players.\n\nRICHTEXT COMMANDS\n\nColor <font color=\"\"> | want the <font color=\"#F FA500\">orange</font> candy.\n| want the orange candy.\nSize <font size=\"\"> This is <font size=\"50\">big</font>.\nFont Face <font face=\"\"> <font face=\"Michroma\">This appears in Michroma font.</font>\nBold <b> This is a <b>bold</b> word.\nItalic <i> This is an <i>italicized</i> word.\nUnderline <u> This word is <u>underlined</u>.\nStrikethrough <s> This applies <s>strikethrough</s> to text.\nCO BAR OK!\nLine break occurs after this sentence.\nSmall Caps <smallicaps>\n<sc> My name is <smallcaps>Diva Dragonslayer</smallcaps>.\n\nUses: Stories, Guides, Newspapers, Magazines, Comics\nRequires: Wood, Cloth, Charcoal\nMalleability: none\n","hammer":"TOOL: HAMMER\nThe Hammer tool enables advanced building features. It has 6 sub-tools:\n\n-Dye: Paints parts. Hover over an object and press Q to pick the object's color.\n-Surface: Adds different surfaces to parts, such as hinges.\n\n-Config: Configures properties of certain parts.\n\n-Resize: Resizes parts, depending on their malleability.\n\n-Size Copier: Can be used to rapidly set several parts to the same size.\n\n-Link: Constraint Joint tool that can add 3 types of Constraints:\n*SpringConstraint: A customizable spring between two items.\n*RopeConstraint: A rope between two items that will not let them move too far apart.\nWhen connected between Pipe, it becomes a Hose that can transfer substances.\n*RodConstraint: A rigid rod between two items. When linked from a DriveBox to an\nEngine, SteamEngine, Turbofan, or Motor, it will act as a driveshaft.\n*BallConstraint: A 360 degree pivot. The two parts will be set not to collide.\n\nUses: Advanced Building\nRequires: Wood, Iron, Leaves\n","firewood":"PART: FIREWOOD\nFirewood is a variant of Wood that burns for 2 minutes, and is much weaker.\nUses: Fires\n\nRequires: Wood\nMalleability: Fair\n","lexan":"PART: LEXAN\n\nLexan is a transparent polycarbonate material that can be used in place of Glass or TintedGlass\nfor windows. It is flammable and more expensive than Glass, but many times stronger.\n\nUses: Bulletproof Glass\nRequires: Ashes, Oil, Silicon, LiquidNitrogen\nMalleability: Good\n","spacejet":"TOOL: SPACEJET\n\nThe SpaceJet produces a small amount of thrust in the direction the mouse is pointed.\nThough the thrust is too small to be of much use on Earth, the SpaceJet allows\ncontrolled movement through space.\n\nSpaceJets have a limited amount of fuel.\n\nUses: Space Movement\nRequires: Titanium, Plastic, Gold, LiquidNitrogen\n","viper":"TOOL: VIPER\n\nThe Viper is a continuous-beam energy weapon with a volatile power source. Though it never\nneeds to be reloaded, firing it for too long may cause it to overheat and explode. The Viper's\nheat level is displayed on bars on the top of the weapon.\n\nViper Ammunitions: (load an ammo by using the Ammo button in Produce GUI):\n-Default: Normal energy beam.\n-Uranium: Turbobeam which overheats faster and has a short range, but much more powerful.\n\n-Abantium: Static field beam which overheats slower and is harmless, but instead can lock onto\na target and manipulate or even throw heavy objects.\n\nUses: Weapon, Object Movement\n\nRequires: Zaktralia, Aluminium, Gold, Silicon, Ceramic\nRange: Medium\n\nDamage: Medium\n\nFiring Rate: Continuous\n","brick":"PART: BRICK\nA material that is heavier but stronger than Stone, and more malleable.\nUses: Construction\n\nRequires: Stone, Ashes, Ice\nMalleability: Good\n","psibutton":"PART: PSIBUTTON\n\nA PsiButton sends a signal when clicked similar to the Button, but with unlimited\nclickable distance.\n\nUses: Controls\nRequires: Copper, Eridanium, Quartz\nMalleability: Poor\n","graphicscard":"PART: GRAPHICSCARD\nWhen connected to a Computer, a GraphicsCard enables drawing of onscreen 3D graphics.\nUses: Computer Attachment\n\nRequires: Quartz, Gold, Aluminium, Neodymium, Silicon\nMalleability: none\n","rpg":"TOOL: RPG\n\nThe RPG launches missiles that explode with more accuracy than the Grenade.\nRPG Ammunitions (load an ammo by using the Ammo button in Produce GUI):\n\n-Default: Seeking rockets which lock on to any player or object hovered over with the\nmouse.\n\n-Explosives: Unguided but more destructive rocket.\n\n-Amethyst: Non-explosive guided rocket that flies above the target and progressively drops\narmor-breaking needles. Longer flight time than the other types.\n\nUses: Weapon\n\nRequires: Explosives, Aluminium, Nitroglycerin, Silicon, Titanium\nRange: Medium\n\nDamage: High\n\nFiring Rate: Slow\n","factory":"PART: FACTORY\n\nA Factory creates a constant supply of raw materials. Insert any basic Material into\n\nthe Factory, and it will supply that item to anyone who is manufacturing a part less\nthan 600 studs away, as well as spawning in models. Each Factory has a 5-second delay\nbefore supplying a new part to any player; build more Factories to supply faster. Enemy\nteam members cannot use another team's Factories during a war.\n\nLIST OF FACTORIABLE ITEMS:\n\nAbantium, Cotton, Wood, Stone, Ice, Copper, Iron, Silicon, Gold,\nFlint, Diamond, Eridanium, Aluminium, Titanium, Glass, Leaves, Magnesium,\nSand, Ashes, Ruby, Quartz, Oil, Lirvanite, Charcoal, Sulfur\n\nUses: Part Supply\nRequires: Iron, Gold, Copper, Quartz\nMalleability: none\n","radio":"PART: RADIO\n\nA Radio is a simple message transceiver which broadcasts nearby player chats to other Radios\nwith the same frequency ID (set by the Hammer's Adjust tool) while powered, displaying them\nin the normal chatbox. When first spawned, it will automatically set itself to the ID of the\nnearest Radio within 300 studs.\n\nClick on a powered Radio to send an attention-getting ring signal to receiving Radios.\n\nBecause Radios use the same wireless channels as Antennas, they can also send and receive\ndata with machines.\n\nUses: Communication\n\nRequires: Quartz, Copper, Aluminium\nMalleability: Poor\n\nPower Usage: 0.5/second\n","photonshard":"PART: PHOTONSHARD\n\nPhotonShards are rare items found only inside comets, which occasionally pass above Earth\nbut are difficult to catch because of their high speed. They have the unusual property of\nrapidly healing nearby players.\n\nWhen attached to a Warhead, PhotonShards increase the explosive power similar to Plutonium\nbut without the instability and radiation.\n\nUses: Manufacturing, Healing\nObtained: Capturing and breaking open a comet\nMalleability: none\n","pistol":"TOOL: PISTOL\n\nThe Pistol is a short ranged weapon (80 studs) that fires quickly, and is good VS\nplayers. Can do a small amount of damage to parts.\n\nPistol Ammunitions (load an ammo by using the Ammo button in Produce GUI):\n\n-Default: Short-range bullets.\n\n-Ruby: Powerful but inaccurate scatter bullets, with slower reload.\n\n-BeamCannon: Laser Pistol with flame chance, better range and fire rate, but less damage.\nUses: Weapon\n\nRequires: lron, Gunpowder, Gunpowder, Titanium\n\nRange: Short\n\nDamage: Medium\nFiring Rate: Fast\n","lasertargeter":"PART: LASERTARGETER\n\nLaserlargeters output the 3D coordinates of where a player's mouse is pointing while the\nleft mouse button is held down (with no tools selected). Connect the LaserTargeter to a\nSeat or SteeringSeat to use; a harmless laser dot will be cast for the player in the seat.\n\nThe color of the laser dot is set by the color of the part (can be changed using CMOS),\nand the dot will be invisible if the color is low in brightness.\n\nLaserlargeters require no external power.\nUses: Target Designation, Drones, Homing Missiles, Laser Pointer\n\nRequires: Ruby, Copper, Glass, Silicon\nMalleability: none\n","torch":"TOOL: TORCH\n\nTorches are used as a light source, a weapon, and lighting fires. Torches must be lit\nbefore use by touching it to a burning part. When put back into the inventory, they are\nput out and must be relit when equipped again. Lit Torches have the ability to throw\nfireballs a short distance by clicking. Torches are always lit in PvP events, and do not\nwork underwater or in space.\n\nTorch Ammunitions (load an ammo by using the Ammo button in Produce GUI):\n-Default: Fast-firing fireballs that can set parts and players on fire.\n\n-Gunpowder: Slower firing fireball that splits on impact, and thrown much further.\n-ProtaliumOxide: Slow firing fireball that splits into splitting fireballs.\n\nUses: Weapon, Portable Light, Firemaking\n\nRequires: Oil, Wood, Charcoal\n\nRange: Medium\n\nDamage: Medium\nFiring Rate: Fast\n","antenna":"PART: ANTENNA\n\nAntennas permit wireless transfer of energy and signals.\nUse the Hammer's Config Tool to set two of them to the same ID, and if the\nconnection is successful both will turn green.\n\nThey can transfer signals from an unlimited distance (unless they are in different\ntimeframes or moving faster than light); however, energy transfer is limited to 120 studs.\nAntennas are commonly used to to transfer energy between a hinged joint.\n\nUses: Wireless Communication, Power Transmission\nRequires: Quartz, Copper\nMalleability: Poor\n","programming":"SYSTEM: PROGRAMMING\nYewscript is a programming language unique to Scarlet Skies, used by in-game Computers.\n\nThe Keyboard's GUI has an upper and lower window for entering YewScript programs depending\non the user's preference. In the upper window, instructions are seperated by new lines, and\n\nby slashes in the lower window. No spaces are used in the programming syntax (besides any\nspaces contained in strings).\n\nExample for lower window: ae0/printA/A+t/goto2\n\nExample for upper window:\n\nA=0\nprintA\nA+1\ngoto2\n\nNote that programs will only run if containing more than one instruction.\n\nEach statement begins with its case-sensitive word, followed by arguments seperated from each\nother by apostrophes ('), but not seperated from the word.\n\nExamples: printHello/wait3, signal225'Hello/wait3\n\nThe only exception to this order is when setting or performing arithmetic on a variable, where\nthe variable is first, followed by an operator.\n\nExamples: A=Hello/printA/wait3, C=0/C+10/printC/wait3\n\n\"if\" statements are also formed a bit differently, with no seperation between the arguments except\nfor the operator used. When the statement is false, all code between the \"If\" statement and the next\n“end” will be skipped. “else” may also be used in between these. Also, in all cases, undefined\nvariables are referred to as “nil”.\n\nExamples: IfB=nil/Printit is nil./End, IfC>0/PrintLarger/Else/PrintSmaller/End\n\nVariables are referenced using capital letters from A to Z, giving a total of twenty-six RAM slots.\nTo define the literal letter instead, use a percentage in front.\n\nExamples: H=100/H\\2/printH, print%R/wait3\n\nLists are simply strings/numbers seperated by semicolons “;\". Variable Z is special in that\nit is overwritten while looping through a “for” list, which is set to each item in the list\nas it loops. You may add to or remove from a list using “insert™ and “remove”.\n\nExample: A=One; Two; Three/forA/printZ/waitt/endloop\n\nThe “goto” and “leapto\" instructions are used to jump to a specific line in the program, and\ncan create loops if jumping to a previous section.\n\nExamples: b=2/b*2/printb/goto2, printPermanent Message!/leapto0\n\nComments (notes/markers that do nothing) can be achieved by placing \"-\" at the beginning\nof an entry, as in Wait1/-Marker/Goto1.\n\nWhen using a “:\" in any data, it will automatically be changed to \";\".\n\nreset: Resets all loops, settings, and clears all variables.\n\ngoto[line]: Jumps to [line] in the program.\n\nlock[id]: Locks computer until [id] entered with Keyboard or Channel 10. Use 0 to unlock.\nbox[id]'posX'posY'sizexX'sizeyY'text'color'textcolor: Creates a text box.\nimgbox[id]'posxX'posyY'sizeX'sizeY imageid'backcolor'imgcolor: Creates an image.\ndelete[id]: Deletes any GUI.\n\nchange[id]'posX'posY'sizexX'sizeyY'text or image'color1'color2: Changes any GUI.\nerrmode[num 0-1]: Ignores runtime errors if set to 0.\n\nspeed[num 0-6]: Sets processor speed. Upper limit increases by 2 for each cluster node.\nbeep[pitch 0-100]'[length]: Emits a sound. Length is optional.\n\nfor[data]: Loops over each list item in [data], setting variable Z each time.\n\nendloop: Marks the end of a “for” or “loop”\" section.\n\ninsert[variable]'[data]'[pos]: Inserts [data] into a list. [pos] is optional.\nremove[variable]'[pos]: Removes item at [pos] from a list. Use -1 for first and 0 for last.\n[variable][operator][data]: Sets or performs an operation on a variable.\n\nbeacon[id]'[data]: Broadcasts [data] across the network, expiring after 10 seconds.\nloop[num]: Loops the following code section [num] times.\n\nif{[data1][comparator][data2]: Ignores the following section if the statement is false.\nprint[data]: Displays [data] on the monitor.\n\nsignal[data]'[channel 0-9]: Sends [data] signal through Mode [channel] Polysilicon.\nsign[data]: Displays [data] on a sign.\n\nelse: Used between an \"if\" and “end” to inverse the “if\" statement.\n\nwait[num]: Pauses the program for [num] seconds.\n\nend: Marks the end of an “if\" section.\n\nleapto[lines]: Jumps forward or backward [lines] in the program, can be negative.\ncube[id]'posX'posY'posZ'sizexX'sizeyY'sizeZ'texture'color'rotX'rotY'rotZ: Creates a 3D rectangle.\nopen3d: Starts the 3D renderer.\n\nclose3d: Stops the 3D renderer and deletes all 3D objects.\ncam[posX]'posyY'posZ'lookposX'lookposY'lookposZ: Moves the camera to pos, looking at lookpos.\ncamangle[rotX]'rotY'rotZ'distance: Rotates the camera, with distance from current position.\nmod[id]'posX'posyY'posZ'sizeX'sizeY'sizeZ'texture'color rotX'roty'rotZ: Changes a 3D rectangle.\nsend[address][data]'[channel 1-12]: Transmits [data] to computer at [address] through [channel].\nsweep[variable]'[data]: Removes all instances of [data] from [list].\n\nclosebeacon[id]: Manually deletes data beacons of [id] from this computer.\n\ndestroy[id]: Deletes a 3D object.\n\nboot: Runs the program when the computer is first powered, if saved on the disk.\n\nencrypt: Prevents the program from being read by players, if saved on the disk.\ncredit[address]'[amount]: Sends [amount] credits to [address] if both have a Bank.\ntranslate[id]'X'Y'Z: Moves a cube based on its current direction.\n\nwritefile[data]: Overwrites the Computer's internal memory to [data].\n\nwritechip[data]: Overwrites a connected MemoryChip to [data].\n\n[variable][operator][data]: Sets or performs an operation on a variable.\n\nOPERATORS\n\n: Sets [variable] to [data].\n\n+: Adds [variable] to [data].\n\n-: Subtracts [data] from [variable].\n\n* or’: Multiplies [data] by [variable].\n\nNOTE: The * symbol conflicts with model data, so - should be used in a model-loaded Computer program.\n\\ (backwards slash): Divides [variable] by [data].\n\n“: Multiplies [variable] by itself [data] number of times.\n\n@: Rounds [variable] to whole number depending on [data]. -1 = lower, 1 = upper, 0 = closest.\n\n>: Sets [variable] to [data] if [data] is less than it is.\n\n<: Sets [variable] to [data] if [data] is greater than it is.\n\nKEYWORDS\n\nWhen setting a variable with \"=\", case-sensitive keywords can be used, as in C=Buffer'0.\n\nBuffer’ [channel 0-13]: Sets [slot] to the last data received from [ch] channel.\nRand: Random number between 0 and 1.\n\nTime: Time elapsed in seconds since the program started.\n\nSelf: The source code of the running program.\n\nCursorx: X position of the mouse on the Keyboard's touchpad.\n\nCursoryY: Y position of the mouse on the Keyboard's touchpad.\n\nPort: Network address of the computer.\n\nScan'[id]: List of ports beaconing [id].\n\nGet'[id]: Gets the data of the first network beacon with [id].\nProp2D'[id]'[argument number]: [argument] property of GUI [id]. (aka, Argument 3 would get posY)\nProp3D'[id]'[argument number]: [argument] property of cube [id]. (aka, Argument 3 would get posY)\nTouch2D'[id]: List of GUIs touching GUI [id].\n\nTouch3D'[id]: List of cubes touching cube [id].\n\nMagnitude[X]'[Y]'[Z]: Distance of the vector.\n\nPlayers: List of all players currently in Scarlet Skies.\n\nUser: Nearest nearby player to the Computer, if any.\n\nYear: Game year.\n\nClock: In-game time of day, in minutes.\n\nLength'[data]: String length of [data].\n\nSize'[data]: Number of [data] list items.\n\nFile: Program or data stored on the computer.\n\nChip: Program or data stored on the connected MemoryChip.\n\nRealtime: Real-world time elapsed in seconds since January 1st, 1970.\nFind'[list]'[data]: List position of the first occurrence of [data] in [list].\n\nif{[data1][operator][data2]\n\nOPERATORS\n\n<: Less than\n\n>: Greater than\n\n{: Less than or equal to\n\n}: Greater than or equal to\n\n=: Equal to\n\n!: Not equal to\n\n[: String/list contains (eg. “\"Helloworid” does contain “Hello”)\n\n]: String/list does not contain (eg. “Helloworid” does not contain “Ree”)\n\nKEYWORDS\nWhen using \"=\" or \"!\" as an operator, the type of data can be checked, as in ifA=String.\nList: Data is a list.\n\nString: Data contains letters or other non-number characters.\nNumber: Data is a number.\n","iron":"PART: IRON\n\nIron is a heavy, dark gray metal with fairly high strength. It is one of the most\nimportant materials, as it is used directly or indirectly to create most modern\ntechnologies.\n\nUses: Armor, Frames, Vehicles\nObtained: Iron Ore Mine\nMalleability: Fair\n","engine":"PART: ENGINE\n\nThe Engine is an internal combustion motor that converts Oil or Gas into motion.\n\nParts attached to the hinge on the Engine will spin at a speed that can be set with\n\nthe Hammer's Config Tool or an attached Controller. The size of the Engine increases\ntorque and maximum speed, but also fuel usage and inertia. Speed level 1 is idle speed,\nand does not transmit power to the hinge. They can still run underwater if slightly\nbelow the surface.\n\nGas-powered Engines are superior to their Oil-powered counterparts in both fuel usage\nand maximum speed.\n\nEngines that take damage can be repaired using the Wrench tool.\n\nLinking with a RodConstraint to a DriveBox creates a driveshaft that can turn the\nDriveBox's hinge.\n\nUses: Vehicles, Aircraft, Seacraft\nRequires: lron, Diamond, Copper\nMalleability: none\n","prospector":"PART: PROSPECTOR\n\nA Prospector searches for underground resources directly beneath when clicked or signaled\nand displays what is found. Prospectors require no power and can be used at any altitude.\n\nScan results are outputted to Mode 3 Polysilicon.\nUses: Underground Resource Scanning\n\nRequires: Aluminium, Silicon, Titanium, Diamond\nMalleability: none\n","lcd":"PART: LCD\nAn LCD is a versatile, transparent screen for displaying images and data.\n\nUse the Hammer's Config tool to edit the LCD's listed images (number-only image asset\nIDs seperated by semicolons, e.g. 6033260663; 3250870006; 8651963992, which will be shown\non top of one another. All images are displayed by default, but each can be individually\ntoggled on and off using Polysilicon.\n\nMode 0 Polysilicon displays, Mode 1 hides, and Mode 2 toggles. Send the list position of\nthe desired image through the Polysilicon (1 = first image, 2 = second image, and so on).\nSend \"0\" to apply the operation to all images at once.\n\nSignaling an LCD directly will display numbers as text across the entire screen, or in the\ntop-left corner if there is at least one image present.\n\nLCDs do not require energy.\nUses: Crosshairs, Custom GUls, Data Displays, Video Clips\n\nRequires: Silicon, Glass, Magnesium\nMalleability: Excellent\n","clock":"PART: CLOCK\n\nA Clock keeps track of the current time and year (year is the red number). It requires no\npower to operate.\n\nEach game hour (30-60 real life seconds), Clocks signal the current hour (0-23).\nUses: Timekeeping, Timers\n\nRequires: lron, Quartz, Glass\nMalleability: Fair\n","beamcannon":"PART: BEAMCANNON\n\nThe BeamCannon fires a constant ray of energy depending on the ammo inserted. BeamCannons\nmust be powered to operate. To turn on and off, click or use attached Polysilicon. Length\n\nof the barrel increases the range of the beam. Inserted ammo will only be accepted if\n\nboth the ammo and the BeamCannon are unlocked.\n\nAMMUNITION\n\n--Ruby: Constant laser beam that burns players and parts, but weak at small sizes.\n\n--Protalium: Tractor beam. Harmless beam that can attract objects; attraction speed\nis determined by width. Adjust Firing Mode 1 to repel instead of attract.\n\n--Y: Tachyon beam. Concentrated energy ray, uses vast amounts of power.\n\n--Uranium: Embrittlement beam. Rapidly weakens targets, but cannot damage on its own.\nLarger sizes use less energy. Much lower range than the other ammo types.\n\nUses: Weapon, Power Transmission, Flare, Tractor Beam\nRequires: Copper, Magnesium, Titanium, Gold, Glass\nMalleability: Fair\n\nPower Usage: Variable\n","quartz":"PART: QUARTZ\n\nQuartz is a slightly translucent rock. Alone, it has few uses other than strong windows.\nIt is obtained by Stone mining; each time Stone is mined, there is a small chance to\nmine Quartz as well.\n\nUses: Windows, Manufacturing\nObtained: Stone Mining\nMalleability: Fair\n","carbonfiber":"PART: CARBONFIBER\n\nCarbonFiber is a relatively strong and lightweight material. Though only moderately malleable\nand damaged by weather, it can be useful for situations requiring a high strength-to-weight\nratio. CarbonFiber is also immune to LiquidNitrogen.\n\nUses: Armor, Construction\nRequires: Charcoal, Oil, Acid, Silicon\nMalleability: Fair\n","scubasuit":"PART: SCUBASUIT\n\nA ScubaSuit allows the wearer to swim with no time limit. It protects against extreme\ntemperatures as well while underwater.\n\nUses: Underwater Breathing\nRequires: Aluminium, Leaves, Glass, Ashes\nMalleability: none\n","launcher":"PART: LAUNCHER\n\nLaunchers are weapons that can hurl many different types of free-falling or self-propelled\nprojectiles. Larger Launchers fire faster, and longer\n\nones throw the projectile further. Launchers must be at least 4 studs long and 2 studs\nwide to function. Use the Hammer's Config Tool to select a type of projectile, and an\nammunition type can be inserted into the Launcher to modify the projectile properties.\nFire by signaling (requires attached Ammo container).\n\nLIST OF PROJECTILES (TYPE)\nDARTS (0)\n\n-Normal: Small missile that seeks a position set by the signal sent to the Launcher. If\n\nthe signal is not a valid position value, the missile is dumbfired (unguided).\n\n-Seeker: Heat-seeking missile that targets significant heat sources such as operating\nengines. It costs more ammo, and does not target anything within 150 studs of the Launcher.\n-Propeller: Torpedo dart for underwater use. Locks on to running Engines/Motors. Torpedoes\nare slow, but last longer and deal more damage.\n\nBOMBS (1)\n\n-Normal: High-explosive aerial bomb.\n\n-Magnesium: Firebomb that does less explosive damage, but spreads flaming debris.\n\n-Stone: Concrete \"bomb\" which does not explode, but smashes heavily armored targets. Damage\nincreases with the height it is dropped from.\n\nMINES (2)\n\n-Normal: High-explosive mine that hides itself when deployed and explodes on contact. Mines\ncan last indefinitely, but will despawn if the Launcher that fired them is destroyed or if\n\nthe Launcher fires more than 10 at a time. Can float in water.\n\n-Titanium: Bounding mine that does less explosive damage, but throws deadly fragments.\n-Missile: Flak-rocket mine effective against aircraft passing overhead.\n\nEMBERS (3)\n\n-Normal: Lightweight burning material that can distract heat-seeking missiles if the ember is\nbelow the target. High damage vs. BaseCenters, Hulls/CrudeHulls, and Balloons.\n\n-Sulfur: Corrosive splash ember with a concentrated area of effect, and twice the ammo usage.\n-AlkalineCell: Charged ember which can arc electricity to nearby objects.\n\n-Oil: Smoke bomb. Creates huge smoke clouds to confuse or conceal. Smoke color is the color\nof the Launcher.\n\nUses: Weapon\nRequires: Titanium, Iron, Aluminium, Ruby\nMalleability: Good\n","relics":"PARTS: RELICS\n\nRelics are exceedingly rare parts with mysterious and powerful abilities. Connect all\neight Relics together and click the Orb to reveal the final secret of Scarlet Skies.\n\nUses: 7???\nObtained: 7???\nMalleability: none\n","tintedglass":"PART: TINTEDGLASS\nType of glass that can only be seen through one way.\nUses: Windows, Observation\n\nRequires: Glass, Aluminium\nMalleability: Good\n","cloth":"PART: CLOTH\nCloth is weak, thin, very light material.\n\nIt can absorb liquids on contact, and produces a lot of smoke when burned if it\nabsorbed Oil.\n\nUses: Construction\nRequires: Cotton\nMalleability: Poor\n","ice":"PART: ICE\nIce is a slippery part. It quickly melts if exposed to fire.\nUses: Slippery surfaces\n\nObtained: Snowy terrain\nMalleability: Good\n","hyperdrive":"PART: HYPERDRIVE\n\nA HyperDrive is a special type of spaceship engine that allows instantaneous travel to\nspecific planets. It uses 5000 energy per jump, and HyperDrives can only be activated\nin space.\n\nThe HyperDrive is the fastest and most precise way to travel to other planets.\n\nTo use, you must enter in the planet's ID number (Earth's is 111111) and connect to power.\nWhen activated, it must charge for approximately 18 seconds before a hyperjump. If the\nhyperfield is attacked while charging, the jump will fail.\n\nThe ID number can be changed by clicking the buttons or by signaling with a valid code,\nwhich must be 6 digits and does not contain 7, 8, 9, or 0. Both normal (123456) and list\nformats (1;2;3;4;5;6) are accepted.\n\nWARNING:\n\nThe HyperDrive will re-activate if it is not turned off after use. Disconnect power when\ncharging begins, since the HyperDrive does not draw extra power during charging.\n\nUses: Interstellar Travel\n\nRequires: Lirvanite, Eridanium, Gold, Abantium, Silicon\nMalleability: none\n\nPower Usage: 5000 per hyperjump\n","accelerator":"PART: ACCELERATOR\nAn Accelerator is a massive synchrotron used for the production of Zaktralia.\n\nTo create a slab of Zaktralia, insert a single Diamond into the Accelerator while powered.\nThe Accelerator's core must have a completely clear view of the sky. Due to the enormous\namount of energy used in the process, only the most substantial power systems will be able\nto bear the load.\n\nAccelerators do not corrode in storms.\n\nUses: Zaktralia Production, Special Effects\n\nRequires: Neodymium, Uranium, Jade, Copper, Aluminium, Gas\nMalleability: none\n\nPower Usage: 1500/second\n","gravdevice":"PART: GRAVDEVICE\nWhile powered, a GravDevice generates a large field of artificial gravity in space.\n\nArtificial gravity, in addition to making spacecraft cabin movement easier, will also\n\nprevent heating on re-entry. However, this comes at a cost of the spacecraft's hull being\nunder full gravitational force, which may cause it to fall through the universe if inadequate\nforce is provided to keep it floating.\n\nUses: Player Transportation\n\nRequires: Abantium, Eridanium, Quartz, Gold\nMalleability: none\n\nPower Usage: 2.27 energy/second\n","standards":"STANDARD CONTROLS\n\nThis ts a list of standardized vehicle controls which Automatons understand. While one\ncan assign different controls to vehicles, Automatons will not be able to use them.\n\nAll controls are optional, and only used if applicable to the vehicle type.\n\nQ = Increase Engine OR Toggle Engine (if Decrease Engine not present)\nE = Decrease Engine\n\nZ = Increase Balloon Height\n\nX = Decrease Balloon Height OR Reverse (if vehicle is not a dirigible)\n\nF = Primary Weapon\n\nControls currently unavailable, but possibly available in future updates:\nG = Secondary Weapon\n\nH = Tertiary Weapon\n\nR= Boost\n\nB = Drop Bomb\n\nC = Activate Special Ability\n\nBackquote = Self Destruct\n","probabilityfield":"PART: PROBABILITYFIELD\n\nProbabilityFields are a special type of armor that ignore any weapon damage bonuses\nand take damage equally from most types of attacks. They are very light and malleable.\n\nUses: Armor\nRequires: Zaktralia, Jade, Neodymium, Acid\nMalleability: Excellent\n","machinegun":"TOOL: MACHINEGUN\n\nThe MachineGun rapidly fires medium-damage bullets. It must reload every 20 shots.\nMachineGun Ammunitions (load an ammo by using the Ammo button in Produce GUI):\n-Default: Standard bullets with medium damage.\n\n-OrganicMatter: Infector bullets which do much less damage, but have a chance to infect\nthe target, which slowly reduces their abilities and can spread. High range.\n\n-Jade: Heavy, longer-range bullets that deal more damage. 6 shots per clip.\n\nUses: Weapon\n\nRequires: Iron, lron, Explosives, Gunpowder, Copper, Gold\nRange: Medium\n\nDamage: Medium\n\nFiring Rate: Rapid\n","eridanium":"PART: ERIDANIUM\n\nEridanium is an extremely strong and heavy material. It is the 2nd strongest and heaviest\nin the game.\n\nEridanium armor is very strong, and can only be destroyed by a few weapons.\nEridanium is not usually found on earth; you will have to travel to another planet to get it.\nUses: Armor, Counterweights, Manufacturing\n\nObtained: Eridanium Ore, found on some planets\nMalleability: Excellent\n","polyestercoat":"PART: POLYESTERCOAT\n\nA PolyesterCoat is the 2nd tier of wearable objects. Put it on by touching it with\nyour character.\n\nPolyesterCoats will regulate your temperature many times better than the Coat, and\ndoes not cause you to overheat. The PolyesterCoat can withstand almost all Earth\ntemperatures.\n\nUses: Temperature control\nRequires: Oil, Quartz, Leaves\nMalleability: none\n","seed":"PART: SEED\n\nSeeds grow into seedling plants when placed on an appropriate surface and clicked. If unable to\nbe planted in a particular spot, a flash will be seen.\n\nInsert into a BioLab to scan the Seed's DNA profile.\nUses: Plant Growth\n\nObtained: BioLab, or harvesting Plants\nMalleability: none\n","firework":"PART: FIREWORK\n\nFireworks launch into the air and burst into colorful fragments when signaled. Size,\ncolor, and the height setting (set with the Hammer's Adjust tool) modify the effects.\n\nUses: Celebrations, Flares\nRequires: Wood, Sulfur, Charcoal, Ashes\nMalleability: Fair\n","computer":"PART: Computer\n\nA Computer is a machine capable of running YewScript programs to display graphics, control\nmachines, or manipulate data. See the Programming help menu page for more information on\nthe YewScript language.\n\nIn most cases, Computers should have a Keyboard and Monitor connected to interact with\nthem, but these are not required. Commands are entered using the Keyboard, and programs\ncan also be run by directly signaling them to the Computer. See the \"Keyboard\" help page\nfor more info on keyboard buttons.\n\nSIGNAL CHANNELS\n\n-Channel 0-9: Signal/internet channels. Use Polysilicon set to mode 0-9 for signaling.\n-Channel 10: Keyboard data entry input.\n\n-Channel 11: Keyboard keystrokes.\n\n-Channel 12: Web server queries.\n\n-Channel 13: Secure bank transfer channel.\n\nCLUSTERS\n\nPowered, idle Computers attached directly (or through others) to one that a program is run\non will cluster them and increase the processing speed of the active Computer.\n\nUses: Command Processing\n\nRequires: Quartz, Gold, Silicon, Copper, Ruby\nMalleability: Fair\n\nPower Usage: 5 energy/second\n","track":"PART: TRACK\n\nTracks are metal rails for Bogies, which will follow along the Track's path. Bends\nor turns in the track can be accomplished with Bends. Tracks can be slightly\nmisaligned/disconnected and still function normally.\n\nRAIL TIPS\n\n-ALWAYS place shorter (30-40 stud) rail segments before and after Bends and slopes.\n-Save long track lengths for straightaways, and have all Bends connected to shorter\nsegments, even if it means shorter segments on each end of the long segment.\n-Place rail vehicles down only on shorter Track segments.\n\n-Make sure absolutely no track sticks up to catch on the Bogie on slopes, even if it\nmeans having a small gap in the rails.\n\n-Do not connect Bends directly to other Bends.\n\n-Have at least 20 studs of Track between each Bend.\n\n-Do not place Bends on slopes.\n\n-Do not stop and back up a rail vehicle while on a Bend.\n\n-Do not go too fast around a Bend.\n\nUses: Trains, Rollercoasters, Elevators\nRequires: Wood, Iron, Stone\nMalleability: Excellent\n","reactor":"PART: REACTOR\n\nA Reactor is a nuclear power generator that can be dangerous and complicated to use,\nbut generates a large amount of energy. It is also the fastest way to heat Containers.\n\nPolysilicon is needed to control the reactor, with each type attached doing a different task:\n-Activator Polysilicon (pink): Lowers control rods; decreases the nuclear reaction.\n-Deactivator Polysilicon (blue): Raises control rods; increases the nuclear reaction.\n-Toggle Polysilicon (tan): Ejects fuel.\n\n-Output Polysilicon (yellow): Outputs temperature signal when Reactor is queried.\n\nTo use, insert up to 4 pieces of Uranium, and raise the control rods to a certain point\n\nto start the nuclear reaction. The core temperature must be above 250 F to generate power.\nThe Uranium fuel rods will decay over time and require replacement. Completely depleted\nfuel rods will transform into weak radioactive waste.\n\nWater and LiquidNitrogen inserted into the Reactor will quickly cool the core. If the core\ntemperature exceeds 1200 F, the Reactor will begin to melt down, and will explode, releasing\nradioactive waste if not cooled down immediately.\n\nInsert EnrichedUranium (from a Lab) into a Reactor to create Plutonium. The Reactor must be\nat operating temperature and with all four fuel rods full.\n\nWhen signaled, the Reactor will output current core temperature through Mode 3 Polysilicon.\n\nUses: Power Generator, Plutonium Production, Dirty Bomb\nRequires: Copper, Stone, Iron, Titanium, Silicon\nMalleability: none\n\nPower Generation: Up to 109 energy/second\n","sail":"PART: SAIL\n\nA Sail is a part that produces a force that varies depending on the wind. It can be\nclicked on to activate or deactivate.\n\nSails are used to harvest the energy from the wind, allowing creation of sailing ships\nor wind power plants. They lose effectiveness when damaged.\n\nUses: Seacraft, Aircraft, Power Plants\nRequires: Wood, Cotton\nMalleability: Good\n","bot":"OBJECT: BOT\nBots are NPC humanoids which can be created or encountered throughout the game.\nCLASSES\n\n-Automaton: Non-respawnable robot which can be created by players. Automatons follow all\norder from their creator (or anyone else with control) without question, but possess very\nlittle independence or individuality.\n\n(Requires: Iron, Silicon, Gold, Computer, Actuator)\n\n-Rogue: Rogues are technologically advanced, having left Earth centuries ago, and can be\nseen on planets or in outer space. They are the guardians of Relics and are hostile to all\nplayers and Bots.\n\nABILITIES\n\nAutomatons are humanoid robots that can be created and given orders. They will obey the\norders given to them by their creator (or at least the first person they see when created).\n\nLIST OF AUTOMATON ORDERS\nEach order must be given in chat, along with the Automaton's name in the sentence (or use\n“all\" to speak to all Automatons under your control).\n\n-Roam: Stop following the player, and wander away at will.\n\n-Come: Follow the player.\n\n-Hate [name]: Attack the named player/bot whenever in sight.\n\n-Forgive [name]: Do not attack the named player/bot in sight anymore.\n-Follow [name]: Follow the named player/bot.\n\n-Stop: Halt the current action.\n\n-Sit: Sit in the nearest regular seat, as a passenger.\n\n-Get Out: Get out of a vehicle or seat.\n\n-Grab [part]: Pick up the nearest unlocked [part].\n\n-Drop: Drops current part.\n","belt":"PART: BELT\nA Belt is a conveyor belt used for moving parts.\n\nWhile the Belt is powered, parts that touch it are moved in the direction of the arrows.\nIt cannot directly move players or other items that aren't standard parts. The speed and\ndirection of the Belt can be adjusted using the Controller or the Hammer's Config tool.\nIf the Belt itself is in motion while in use, power usage is greatly increased.\n\nUses: Part Transport\n\nRequires: lron, Copper, Leaves, Diamond\n\nMalleability: Excellent\n\nPower Usage: 4.25/sec at full speed and not in motion\n","wrench":"TOOL: Wrench\n\nA Wrench is used to repair any part besides BaseCenters that can be progressively damaged.\nThis includes Hulls, CrudeHulls, Sails, Balloons, Engines, SteamEngines, Turbofans, and\nTurboshafts.\n\nLoad a material appropriate for the item being repaired (Cotton, Iron, or Wood) into the\nWrench using the Produce GUI, stand near the part, and click to begin the repair. Both\nthe player and the part being repaired must not move for the sequence to be completed.\nEach repair session restores all aspects of the part to full health.\n\nUses: Part Repair\nRequires: Copper\n","armor":"PART: ARMOR\n\nArmor is a jacket that can be worn to protect against damage.\n\nIt restricts movement like the SpaceSuit, but reduces 50% of most types of damage.\nUses: Protection\n\nRequires: Iron, Wood, Flint\nMalleability: none\n","ballasttank":"PART: BALLASTTANK\n\nA BallastTank allows submarines to float at different water heights. A Controller will\ncontrol the dive depth. BallastTanks slow down seacraft considerably, and may require more\npower to propel. Resize the BallastTank to control the buoyant force.\n\nNOTE: BallastTanks also provide protection within a large radius against seawater corrosion;\nhowever, when in seawater, they also greatly accelerate corrosion of most basic metals and\nstructural parts on the same vehicle, requiring submarines to be armored with parts immune\nto this effect (such as SeaAlloy, Gold, or space materials).\n\nUses: Submarines, Seawater Corrosion Protection\nRequires: Magnesium, Gold, Iron, Aluminium\nMalleability: Extreme\n","signalwire":"PART: SIGNALWIRE\n\nSignalWires transmit signals. Unlike Wires, they also light up when carrying\na signal.\n\nSignalWires painted red will evaporate after passing a signal. This can be used to\nlaunch items, such as Missiles and bombs.\n\nUses: Circuits\nRequires: Copper\nMalleability: Excellent\n","cannon":"PART: CANNON\n\nA Cannon is a highly customizable gunpowder weapon, the next tier from Catapults. They must\nbe linked to an Ammo Container and have an ammunition part inserted to function, and do not\nfire underwater. Both the Cannon and ammo part must be unlocked to insert. Signal or click\n\non a Cannon to fire it.\n\nThe performance and effects of Cannons are determined by the projectile type (set with the\nHammer's Config tool), inserted ammunition type, width, and length.\n\nWidth: Slows firing rate and increases ammo usage, but fires stronger/more projectiles.\nLength: Increases range.\n\nPROJECTILE TYPES:\n\n0. Round: Normal shot (Shell for Titanium/Nitroglycerin).\n\n1. Disc: Moves fast and glides in the air, but less damage.\n\n2. Barrel: Higher damage, but inaccurate and slower reload.\n\n3. Scatter Round: Scattering Rounds, higher ammo usage. (Shell for Titanium/Nitroglycerin).\n\n4. Scatter Disc: Scattering Discs, higher ammo usage.\n\n5. Scatter Barrel: Scattering Barrels, higher ammo usage.\n\n6. Harpoon: High range, and double damage vs. BaseCenters/Sails/Hulls/Balloons, but very slow\nfire rate. Harpoon is fixed-size; the Cannon must be at least 2 studs wide. Copper Harpoon\nbecomes a roped grapple hook that sticks into ground or weak parts.\n\nVICTORIAN AMMUNITIONS:\n\n-lron: Standard, relatively high damage.\n\n-Copper: Faster reload and low ammo usage, but lower damage.\n\n-Gold: High damage, but slow reload, massive amount of ammo used, and less range.\n-Glass: Shatters on impact, damaging unprotected players nearby. Lower ammo usage.\n-Oil: Less impact damage, but has a small chance to set targets on fire.\n\n-Dynamite: Medium-strength explosive, but higher ammo usage.\n\nMODERN AMMUNITIONS:\n\n-Nitroglycerin: Devastating explosive, but slow reload and very high ammo usage.\n-Titanium: Armor-piercing; can cause damage underneath an armor layer. Higher ammo usage.\n\nPOSTMODERN AMMUNITIONS:\n\n-Zaktralia: Plasma splash. High damage, fast reload, and floating. Higher ammo usage.\n","lasersword":"TOOL: LASER SWORD\n\nLaser Swords can instantly kill players and bots, and weakly damage parts. They can\ncut apart Balloons almost instantly.\n\nUses: Weapon, Light Source\nRequires: Zaktralia, Ruby\nRange: Melee\n\nDamage: Very High\n\nFiring Rate: Fast\n","brake":"PART: BRAKE\n\nA Brake exerts a horizontal force to slow and stop itself while active. To toggle, click\non it or signal connected Polysilicon. Brake force increases with size.\n\nBrakes connected to a Controller automatically engage when the Controller is set to 0.\nIn models, Brakes are loaded inactive if their color is set to “Really black”.\nUses: Velocity Reduction\n\nRequires: lron\nMalleability: Poor\n","ionrocket":"PART: IONROCKET\n\nAn lonRocket is a type of spaceship engine, converting energy to force.\n\nlonRockets, like LiquidNitrogen Rockets, are usually too weak to be used in a gravity\nfield (such as launching from Earth) and are best used for mid-space travel in zero\ngravity. They are slower than other space engine types, but are compact and silent.\n\nTo make the lonRocket hover when deactivated instead of falling, attach an Anchor to it\nand click the Anchor once.\n\nUses: Spacecraft\n\nRequires: Neodymium, Gold, Magnesium, Titanium\nMalleability: none\n\nPower Usage: 31.5 energy/second at full power\n","acid":"SUBSTANCE: ACID\n\nAcid is a corrosive liquid which eats through many types of parts. Containers of Acid destroy\nany loose part on contact, at the cost of 1/10th of a droplet each.\n\nAs a liquid substance, Acid evaporates unless kept in a Container, and can be transferred\nthrough Pipes, Controllers, Valves, Fuel Cans, and Faucets.\n\nUses: Part Cleaning, Weapon\n\nObtained: Empty Container attached to Container of Water exposed to Firebox smoke\nMalleability: none\n","speaker":"PART: SPEAKER\n\nA Speaker produces a sound when signaled, selectable with the Hammer's Config Tool.\nThe Speaker's volume is controlled by it's size (maximum volume: 4x5x4).\n\nWhen connected to a computer, it will play sound files.\nUses: Alarms, Sound Files, Indicators\n\nRequires: lron, Copper\nMalleability: none\n","fuelcan":"TOOL: FUELCAN\n\nA FuelCan is a handheld container that can be used to transfer substances between\nContainers. Touch the FuelCan to a Container with a substance inside of it to fill it,\n\nand then touch the Container to be filled. FuelCans have as much capacity as a Container\nat full size.\n\nFuel Cans will be dropped if the player attempts to sit down with one in the inventory.\n\nUses: Substance Transfer\nRequires: Leaves, Copper\n","ore":"PART: ORE\n\nOres must be refined by attaching them to an unpowered Refinery, or inserting into a\npowered Refinery.\n\nUses: Materials\nObtained: Harvesting certain resources\nMalleability: none\n","radiationsuit":"PART: RADIATIONSUIT\n\nA RadiationSuit will provide resistance against ionizing radiation. It can greatly\nreduce of most types of radiation, but is ineffective with very high amounts.\n\nUses: Radiation Protection\nRequires: lron, Wood, Ashes, Charcoal, Glass\nMalleability: none\n","nitroglycerin":"SUBSTANCE: NITROGLYCERIN\n\nNitroglycerin is a highly unstable liquid. Containers of Nitroglycerin, as well as droplets,\nexplode from hard impacts.\n\nAs a liquid substance, Nitroglycerin evaporates unless kept in a Container, and can be\ntransferred through Pipes, Controllers, Valves, Fuel Cans, and Faucets.\n\nUses: Weapon\nObtained: Empty Container attached to Container of Acid attached to a powered Refinery\nMalleability: none\n","spawnpoint":"PART: SPAWNPOINT\n\nA SpawnPoint will enable the player that created it to respawn at the SpawnPoint's\nlocation after death.\n\nUses: Respawning\nRequires: Quartz\nMalleability: none\n","hull":"PART: Hull\n\nHulls float on the ocean, enabling watercraft to be built on them. Hulls are stronger than\nCrudeHulls and cannot burn, but are more expensive and have slightly lower weight capacity.\n\nNOTE: Any watercraft must have all hulls connected to each other (not seperated by other\nparts), failure to do so may cause the watercraft to flip.\n\nAny hulls will crack when damaged enough to be breached, and begin to take on water. Using\na BilgePump will pump water out from all hulls on the watercraft at once, and the\nWrench tool may be used to repair them. They are very weak on land.\n\nIf a hull is removed/destroyed, hulls that were connected to it will be severely damaged.\nUses: Rafts, Ships, Seaplanes, Amphibious Vehicles\n\nRequires: Copper, Magnesium\nMalleability: Extreme\n","pod":"PART: POD\n\nPods are futuristic treasure chests that are occasionally found on other planets. They\ncontain a rare item. Rare items are sometimes powerful (and usually impractical) objects\nthat have no HelpMenu information, cannot be duplicated or saved, and cannot be obtained\nin any other way.\n\nA Pod will only open if it is brought near the ground on Earth and clicked. They also\nemit a bright blue beacon (visible from 400 studs away) to aid in their discovery.\nRarely, Pods may land on Earth from space as well.\n\nNOTE:\nPods cannot be found on planets that were hyperjumped to, or during LightSpeed events.\n\nWARNING:\nPods are unstable, and will explode if teleported or moved at an extreme speed\n(such as when used with HyperDrives, WarpGates and Teleporters)\n\nCurrently, there are 21 rare items in existence.\nUses: Obtaining Rare Items\n\nObtained: Alien planets that were found in space, not by HyperDrive\nMalleability: none\n","crate":"PART: CRATE\n\nCrates are able to reliably take parts inside for easier storage or transport.\n\nWhen another unlocked and unwelded part touches a Crate, it will be inserted if it's small\nenough to fit inside. Crates may only store one type of part at a time. The total stored\nvolume cannot exceed the Crate's actual volume, and the parts inserted are resizable, they\nare stored as one cubic stud instead of their default size (but return to default size when\nextracted). Parts stored in a Crate save across servers. Any parts inserted will lose all\n\ndata and configuration properties (except ore types).\n\nRemove an item from a Crate by clicking or signaling with Mode 0 Polysilicon. The exit\nside (front) must be clear of objects. The indicator flashes red if the exit is blocked.\n\nSignal a Crate to output both stored item and stored volume data to Mode 3 Polysilicon.\nUses: Item Storage, Item Transport\n\nRequires: Wood, Copper, Ashes\nMalleability: Good\n","delaywire":"PART: DELAYWIRE\n\nThe DelayWire will delay an incoming signal. They can be used to make simple timers\nfor machines/bombs, or for capacitors that can store signals.\n\nDelayWires will not signal other DelayWires that have been signaled sooner than their delay\nsetting, so that strings of DelayWires won't feed back into each other.\n\nUse the Config Tool to set the number of seconds to delay (up to 1800, or 30 minutes).\nUses: Electronics, Time Bombs\n\nRequires: Copper, Charcoal\nMalleability: none\n","warhead":"PART: WARHEAD\nWarheads are atomic bombs capable of catastrophic damage and surviving re-entry.\n\nTo arm a Warhead, two conditions must be reached: the Warhead needs to travel at a speed\nof at least 50 studs per second for the last 6 seconds, and it has to have been previously\nsignaled with the arming code that can be changed using the Hammer's Config tool. Once\narmed, any signal other than the arming code will cause detonation. Warheads cannot be\ndetonated underneath islands.\n\nThe effect of the explosion differs depending on where the Warhead was detonated:\n\n-Airburst/Space: Wreaks havoc with electronics and triggerable parts within a huge area.\n-Surface: Fireball radius is reduced, but releases much larger amounts of nuclear fallout.\n-Underwater: No flash burns or aerial fallout.\n\nWhile the Warhead alone is effective against virtually any type of target, the explosive\npower can be increased even further by attachments:\n\n-Plutonium: Increases strength by 50% per supercritical piece at the moment of detonation.\n-DeuteriumCap: When used along with at least one PhotonShard or supercritical Plutonium, the\nexplosion goes thermonuclear and strength is doubled (including Plutonium/PhotonShard bonus).\n-PhotonShard: Increases strength by 50%.\n\nTo create a temporal bomb, attach a Warhead to a TimeMachine. When the Warhead is signaled\n(does not require arming conditions), all parts within a 100-stud radius are replaced by\n\nparts brought back from the date selected on the TimeMachine. This regenerates destroyed\nbuildings and items. Attach an EnergyBomb to the TimeMachine to increase the radius to 400.\n\nUnlike most other parts, Warheads can never be unlocked by others when broken off.\nUses: Weapon, Temporal Bomb\n\nRequires: EnrichedUranium, Uranium, Titanium, Silicon, Jade, Aluminium, Ruby\nMalleability: Good\n","flamethrower":"PART: FLAMETHROWER\n\nA FlameThrower is a short-ranged flame weapon which uses Gas or ProtaliumOxide as fuel,\nprojecting a stream of fire hot enough to melt some metals. When ProtaliumOxide is used,\nit becomes a plasma thrower with much greater damage. Longer barrels have increased range.\n\nFlameThrowers are fired by signaling/clicking them, but need to be connected with a fuel\nsupply.\n\nUses: Weapon, Home-Alone Style Traps\nRequires: Titanium, Magnesium, Copper, Quartz\nMalleability: Poor\n","light":"PART: LIGHT\n\nA Light is an electric light that can be resized to control the brightness, and painted\nto control the color of the light. Their energy use depends on their size.\n\nUses: Lighting\n\nRequires: Copper, Glass\n\nMalleability: Fair\n\nPower Usage: 1.25 energy/second at maximum brightness\n","activedefense":"PART: ActiveDefense\n\nAn ActiveDefense is an automatic gunnery module which quickly detects and destroys most\ntypes of incoming projectiles, such as cannonballs or dart missiles. It requires power and\nan ammo supply to function, and will use ammo with each threat successfully intercepted.\n\nSince the ActiveDefense targets only slow-moving fired projectiles, it will have no effect\non BeamCannons, Guns, or other tracefire weapons. It is also unable to defend against part\nweapons like Explosives.\n\nUses: Projectile Shield\n\nRequires: Titanium, Copper, Silicon, Ruby, Diamond\nMalleability: none\n\nPower Usage: 8/second\n","cooler":"PART: COOLER\n\nA Cooler will glow and cool down nearby players when powered. It has higher effective radius\nthe larger it is resized.\n\nIf attached to an empty Container, active Coolers will slowly condense ambient air into\nLiquidNitrogen. This will not work in space.\n\nFood items attached to powered Coolers will have a significantly longer shelf life.\n\nUses: Cooling, LiquidNitrogen Production\nRequires: Copper, Aluminium\n\nMalleability: Poor\n\nPower Usage: 1 energy/second\n","biolab":"PART: BIOLAB\n\nThe BioLab is a machine used for creating, engineering, and analyzing plants, as well as\nthe production of certain substances.\n\nA supply of organic substances are required for BioLab operations. Power the BioLab and\ninsert Wood or Leaves to fill it. OrganicMatter as a part is often produced as a byproduct.\nWhen the bar is full, click \"Generate New™ to create a random new DNA profile, or insert a\nsingle Seed to copy its DNA profile.\n\nThe DNA profile screen shows the stat levels (A-F) and traits of the plant. Click on a stat\nbar to increase it; this requires a small amount of organic supply, and tends to diminish\nall of the other stats when used. Click \"Create Seed\" to spawn a ready-to-plant seed with\nthe corresponding DNA profile (requires organic supply).\n\nClick the TRAITS menu to swap a random trait with another random trait, if one is available.\nThis costs organic supply, and does not remove/add rare or nutrient traits (Photosynth,\nParasite, Fungus). Trait swapping also has a chance of removing a trait with no replacement.\n\nH - Health: Reduces occurrences of plant death.\n\nL - Longevity: Increases the average maximum age the plant can live.\nR - Replication: Increases replication rate and range.\n\nS - Size: Increases plant size and resistance to damaging effects.\n\nG - Growth Rate: Speeds plant growth from seedling to adult.\n\nT - Tolerance: Improves plant survivability in cold or hot environments.\n\n-Photosynth: Thrives in sunlight.\n\n-Parasite: Thrives by leeching nutrients from other species in a wide radius.\n-Fungus: Thrives covered from sunlight. Can grow on any relatively weak part.\n-Seaworthy: Enables growth on the ocean.\n\n-Flamer: Bursts into fireballs on impact.\n\n-Toxic: Kills players on contact, and is converted to Toxin on contact with a Container.\n-Blooming: Occasional bursts of rapid replication.\n\n-Tough: Improved resistance to Herbicide and Herbicidal/Parasite plants.\n-Exclusive: Cannot be analyzed or copied; players are unable to obtain Seeds.\n-Mutator: Mutates more frequently.\n\n-Herbicidal: Harms nearby plants of different species.\n\n-Electric: Generates electricity into nearby PowerCells.\n\n-Wood: Wood can be obtained by harvesting.\n\n-Cotton: Cotton can be obtained by harvesting.\n\n-Superior: Bonus to all stats.\n\nClick the TRAITS menu to swap a random trait with another random trait, if one is available.\nThis costs organic supply, and does not remove/add rare or nutrient traits (Photosynth,\nParasite, Fungus). Trait swapping also has a chance of removing a trait with no replacement.\n\nH - Health: Reduces occurrences of plant death.\n\nL - Longevity: Increases the average maximum age the plant can live.\nR - Replication: Increases replication rate and range.\n\nS - Size: Increases plant size and resistance to damaging effects.\n\nG - Growth Rate: Speeds plant growth from seedling to adult.\n\nT - Tolerance: Improves plant survivability in cold or hot environments.\n\n-Photosynth: Thrives in sunlight.\n\n-Parasite: Thrives by leeching nutrients from other species in a wide radius.\n-Fungus: Thrives covered from sunlight. Can grow on any relatively weak part.\n-Seaworthy: Enables growth on the ocean.\n\n-Flamer: Bursts into fireballs on impact.\n\n-Toxic: Kills players on contact, and is converted to Toxin on contact with a Container.\n-Blooming: Occasional bursts of rapid replication.\n\n-Tough: Improved resistance to Herbicide and Herbicidal/Parasite plants.\n\n-Exclusive: Cannot be analyzed or copied; players are unable to obtain Seeds.\n-Mutator: Mutates more frequently.\n\n-Herbicidal: Harms nearby plants of different species.\n\n-Electric: Generates electricity into nearby PowerCells.\n\n-Wood: Wood can be obtained by harvesting.\n\n-Cotton: Cotton can be obtained by harvesting.\n\n-Superior: Bonus to all stats.\n\n-Edible: Can be clicked to eat, healing the player (or harming if Toxic/Flamer/Popper).\n-Thicket: Grows in tight clusters.\n\n-Nexus: Vines connect between nearby plants, able to grow through walls.\n-Stonecrop: Able to grow on mountains or other stone terrain.\n\n-Capped: Stops replicating after 20 generations, preventing uncontrolled spread.\n-Efficient: More likely to survive when resources are scarce (high plant count).\n-Golden (RARE): Gold can be obtained by harvesting.\n\n-Popper (RARE): Releases extremely destructive orgaballs on impact.\n\n-Withering (RARE): Drains nutrients from nearby players, and powerful while doing so.\n\nUses: Genetic Engineering\n\nRequires: Copper, Titanium, Oil, Sulfur, Glass, Diamond\nMalleability: none\n\nPower Usage: 8/second\n","controller":"PART: CONTROLLER\n\nA Controller is used to modify the speed, direction, or height settings of several items\nin the game. They also can transfer substances (usually a fuel) similar to a Pipe.\n\nWhen connected to any type of motor or engine, the Controller can be used to control\nthe speed and direction. Can also control the speed of spaceship drives.\n\nControllers are the only way to control the height of Balloons and BallastTanks.\nPolysilicon can be used to control the Controller with signals.\nUses: Vehicles, Aircraft, Seacraft, Spacecraft, Valves\n\nRequires: lron, Copper\nMalleability: Fair\n","plastic":"PART: PLASTIC\n\nPlastic is an extremely light and malleable material. It can be used as a building material\nand a manufacturing ingredient.\n\nUses: Construction, Light Aircraft\nRequires: Ashes, Oil, Ice\nMalleability: Extreme\n","motor":"PART: MOTOR\nMotors convert energy into motion, spinning parts connect to their hinges.\n\nThe Hammer's Config Tool can change the direction and speed of the motor. Motors use\nexponentially more power at higher speeds.\n\nLinking any part with a Rope will reel or unreel the rope when the Motor is spun.\n\nLinking with a RodConstraint to a DriveBox creates a driveshaft that can turn the\nDriveBox's hinge.\n\nUses: Machines, Vehicles\nRequires: Copper, Iron\nMalleability: Fair\n\nPower Usage: Variable\n","crudewing":"PART: CRUDEWING\n\nThe CrudeWing is a basic part for aircraft. Moving it in the direction of the decal\nwill lift it upwards; the force is determined by the wing's forward speed and size.\nPitch the wing up and down to control vertical speed.\n\nUses: Aircraft\nRequires: Cotton, Wood, Leaves\nMalleability: Fair\n","singularitybomb":"PART: SINGULARITYBOMB\n\nA SingularityBomb briefly unleashes a miniature blackhole when signaled, which attracts\nnearby objects and obliterates them. Unlike most other bombs, the effect is not blocked\nby walls or energy shields.\n\nUses: Weapons\nRequires: Eridanium, ExoticMatter, Abantium, Gold\nMalleability: none\n","charcoal":"PART: CHARCOAL\n\nCharcoal is a small part that is sometimes obtained from burning Wood.\n\nCharcoal attached to Explosives will catch fire when detonated, acting as firebrands.\nUses: Torches, Embers\n\nObtained: Burning Wood\nMalleability: none\n","titanium":"PART: TITANIUM\n\nTitanium is an extremely strong material, able to withstand many types of weapons. Titanium's\nlack of malleability limits usefulness.\n\nUses: Armor, Manufacturing\nObtained: Subsoil (Derrick)\nMalleability: Poor\n","basecenter":"PART: BASECENTER\n\t\nBaseCenters function as both main spawn points and defense against intruders.\n\nBaseCenters take at least 60 seconds to recharge when being placed. While active, they hurl\ndeadly projectiles at players on an enemy team, players blacklisted, or players not whitelisted.\nEdit the whitelist/blacklist by locking the BaseCenter and clicking on it. Player names in the\nlist are seperated by spaces, and the lists can only be edited outside of team events. The\nPublic/Private setting determines whether the BaseCenter can be used as a spawn location.\n\nThe spiky projectiles it throws kill players on foot (not in a seat) and players in aircraft\nwhich flew too low or landed nearby. They do nothing in other situations with enemies riding\nin vehicles, but still serve as an advance warning.\n\nIf recently damaged, dragging a BaseCenter is temporarily impossible. Each 20% of damage dealt,\nthe BaseCenter will become invulnerable (except to Warheads) for 60 seconds.\n\nBaseCenters will despawn if placed underwater or near another BaseCenter. During team events,\nthey must also have a clear and open area around them to prevent encroachment damage over time.\n\nIf all Factories near a BaseCenter are destroyed, it will eventually spawn a backup Factory\nwith the same materials as the previous Factories. This backup Factory is marked as \"Damaged\"\nmeaning it will not save and refunds almost no Credits if sold.\n\nUses: Anti-PersonneI Defense, Team Spawn\nRequires: Gold, Copper, Quartz, Wood, Flint\nMalleability: none\n","polysilicon":"PART: POLYSILICON\nPolysilicon controls certain items when powered/signaled. List of Adjustable modes:\n\n-Activate: Activates switches, BeamCannons, Valves, DriveBoxes, Brakes, and Mainsprings. Acts\n\nas the + function on Controllers. Lowers Reactor control rods. Causes Lift to go up. Opens\nComboLocks locked to same player. Causes Banks to dispense credits. Input A on CMOS. Dish Seek\nIncreases Servo Angle. Causes MemoryChip to send data. MechLimb relative position. Displays an\nLCD image. Extends Derrick drill. Extracts part from Crate.\n\n-Deactivate: Deactivates switches, BeamCannons, Valves, DriveBoxes, Brakes, and Mainsprings. Acts\nas the - function on Controllers. Raises Reactor control rods. Causes Lift to go down. Closes\nComboLocks locked by same player. Input B on CMOS. Dish Seek Previous. Decreases Servo angle.\nSets MemoryChip data. Mechlimb pointing. Creates a diode when connected to a Mode 0 Polysilicon.\nHides an LCD image. Retracts Derrick drill.\n\n-Toggle: Toggles switches, BeamCannons, Valves, DriveBoxes, Brakes, and Mainsprings. Acts as\nthe Reverse function on Controllers. Ejects reactor fuel. Causes Lift to stop. Toggles ComboLocks\nlocked by same player. Input C on CMOS. Turns off Dish seeking. Resets Servo angle. Toggles\nDriveBoxes. Mechlimb relative pointing. Toggles an LCD image.\n\n-Output: Takes an output signal from devices such as Sensors, Modems, Instruments, and Reactors.\nFunctions as the FALSE/ERROR output for CMOS.\n\nThese modes as well as the other 6 also act as signal channels for Computers.\nUses: Circuits\n\nRequires: Silicon, Quartz\nMalleability: Poor\n","handcannon":"TOOL: HANDCANNON\n\nA HandCannon is a medium-ranged weapon that launches heavy canister projectiles\nwith different effects.\n\nHandCannon Ammunitions (load an ammo by using the Ammo button in Produce GUI):\n-Default: Fragmentation canister that bursts into shards and damages parts.\n-Dynamite: Snapper bomb with a large explosion radius, but relatively low damage.\n-Computer: Flattens itself into a player-seeking disc drone on impact/activation.\nUses: Weapon\n\nRequires: Copper, Wood, Gunpowder, Flint, Gold, Ruby\n\nRange: Medium\n\nDamage: Medium\nFiring Rate: Slow\n","radar":"PART: RADAR\n\nA Radar constantly scans the surrounding area for vehicles, missiles, and other items,\ndisplaying their relative positions. Objects are displayed as the following:\n\n-Green arrow: Radar's location and direction\n-Pink diamond: Nonmoving object\n\n-Pink arrow: Moving object\n\n-Cyan circle: Marker\n\n-House: BaseCenter\n\n-Trefoil: Warhead in motion\n\nA number is displayed on each object showing their relative altitude. Radars work in\ndifferent ways depending on where they are located:\n\n-Default: Radar. Cannot detect objects 30+ studs below ocean surface.\n-Underwater: Sonar. Cannot detect objects 30+ studs above ocean surface.\n-Space: Space Radar. Detects all objects and range is quadrupled.\n\nWarheads, BaseCenters, and markers are always shown regardless of the Radar type.\n\nSignal position data in the form of X;Y;Z to a Radar to display a marker for that\nposition (if in range). Any signal that is not position data deletes the marker.\n\nUses: Navigation, Object Detection\nRequires: Gold, Silicon, Quartz, Copper\nMalleability: none\n\nPower Usage: 0.8/second\n","foam":"PART: FOAM\n\nFoam is an extremely lightweight substance that splits if hit with enough force. Larger\npieces are slightly stronger.\n\nUses: Breakable Part, Construction\nRequires: Ashes, Oil, Leaves, Ice\nMalleability: Excellent\n","botspawn":"PART: BOTSPAWN\n\nBotSpawns spawn a new Jolem shortly after creation (when not being dragged) or when the\nprevious Jolem is killed. Each spawned Jolem is unique, but team and owner remain the\nsame even across servers.\n\nSee the Bots help page for more information on Jolems.\nUses: Jolem Spawn Point\n\nRequires: Quartz, Stone, Leaves, Copper\nMalleability: none\n","gear":"PART: GEAR\n\nGears are iron wheels that gain teeth when clicked. They can mesh with other gears\nfor mechanical uses. Once clicked, Gears cannot be dragged.\n\nUses: Mechanical Devices\nRequires: lron\nMalleability: Fair\n","searchlight":"PART: SEARCHLIGHT\n\nA SearchLight is a special spotlight used to aid in targeting enemy craft at night.\nWhile powered, it will automatically shine a bright orb of light at nearby enemy players\neither far above or below the SearchLight. In addition to make detection easier, it\n\ncan also help to disorient the pilot of the vehicle.\n\nUses: Enemy Detection/Targeting Aid\nRequires: Copper, Glass, lron, Aluminium\nMalleability: none\n\nPower Usage: 2.33 energy/second\n","abantium":"PART: ABANTIUM\n\nAbantium is a metal that is as almost as strong as Iron but 100 times lighter. It is the\npreferred material for spaceships, because it is also extremely malleable.\n\nAbantium is not usually found on earth; you will have to travel to another planet to get it.\nUses: Construction, Aircraft, Spacecraft\n\nObtained: Abantium Ore, found on some planets\nMalleability: Extreme\n","iondrive":"PART: IONDRIVE\n\nAn lonDrive is a type of spaceship engine, converting energy to force.\n\nThe lonDrive's best ability is that it has an unlimited weight capacity and can\npropel any size ship. It also has a good amount of speed, though it is bulky.\n\nTo make the lonDrive hover when deactivated instead of falling, attach an Anchor to it\nand click the Anchor once.\n\nUses: Heavy Spacecraft\n\nRequires: Eridanium, Neodymium, Gold\nMalleability: none\n\nPower Usage: 47.1 energy/second at full power\n","pipe":"PART: PIPE\nPipes transfer liquid from a Container.\n\nWhen two Pipes are connected with Rope, the Rope becomes a Hose and can transfer the\nliquid.\n\nUses: Liquid Transfer\nRequires: lron\nMalleability: Excellent\n","gammadrive":"PART: GAMMADRIVE\n\nA GammabDrive is a type of spaceship engine, converting energy to force.\n\nThe GammabDrive is the fastest of all the spaceship engine types, and is fairly compact.\nHowever, it is much more inefficient, weaker, and has less weight capacity then the\nlonRocket. It also creates a bright particle stream, making it less stealthy.\n\nTo make the GammabDrive hover when deactivated instead of falling, attach an Anchor to it\nand click the Anchor once.\n\nUses: Spacecraft\n\nRequires: Abantium, Lirvanite, Gold, Protalium, Diamond\nMalleability: none\n\nPower Usage: 78.4 energy/second at full power\n","spacesuit":"PART: SPACESUIT\n\nA SpaceSuit allows you to survive the vacuum of space. Put it on by touching it with\nyour character.\n\nThe SpaceSuit will not only allow you to survive space without an Airshield; it\nwill also provide unlimited temperature protection, although slowing you down.\n\nSpacesuits also prevent drowning underwater, but are very difficult to swim in.\nUses: Space Travel, Temperature Control\n\nRequires: Gold, Titanium, Silicon, Ice, Ashes\nMalleability: none\n","magnesium":"PART: MAGNESIUM\n\nMagnesium is a grey, flammable metal. It is very light and strong, but usually unsuitable\nfor a building material due to it's flammability. It will catch fire when struck with\n\na stone surface (mountains, Stone, Quartz, etc), but the flammability is reduced when in\na large mass. Magnesium also catches fire when signaled.\n\nUses: Firestarting, Manufacturing\nObtained: Subsoil (Derrick)\nMalleability: Fair\n","lift":"PART: LIFT\nA Lift is a motorized part that can climb walls.\n\nTo use, the back of the Lift must be directly adjacent to the part to be climbed (such as\nan elevator shaft wall). Simply power the Lift, and click the Lift's buttons to make\nit move up, down, or stop.\n\nPolysilicon can be used to control Lifts: Mode 0 for up, Mode 1 for down, Mode 2 for stop.\n\nUses: Elevators, Mountain Climbing\nRequires: Aluminium, Iron, Silicon\nMalleability: none\n\nPower Usage: 2.6 energy/second\n","commlink":"PART: COMMLINK\n\nA Commlink converts player chats to signals. The first signal entry is the message,\nwhile the second entry is the player's name. Larger Commlinks will recieve chats from\nmuch further away, and vice versa.\n\nUses: Voice Input\nRequires: Charcoal, Copper, Silicon, Magnesium\nMalleability: Poor\n","television":"PART: TELEVISION\n\nTelevisions link to Cameras with the same ID (set with the Hammer's Config tool), and\nshow the Camera's view to any player that clicks it while powered. The screen turns the\ncolor of any part the Camera is pointing to, giving a small amount of feedback even\nwithout clicking.\n\nResizing the Television will affect the resolution (FOV). Larger Televisions show\na higher field of view.\n\nUses: Camera Viewing, Motion Sensing, Video Screens\nRequires: Glass, Diamond, Copper\n\nMalleability: Fair\n\nPower Usage: 0.8 energy/second\n","gun":"PART: GUN\n\nThe Gun is a tracefire weapon that can be customized. The Gun's length increases the\n\nmaximum range, and the width increases damage. Using the Hammer's Config Tool can also\nmodify the caliber of the projectile. Higher calibers have more damage and slightly higher\n\nrange, but fire slower and are less efficient with ammo usage. Range bonuses will not\napply past 26 stud length.\n\nGuns have greatly reduced range when underwater.\n\nLike the Cannon and EnergyCannon, the Gun must be loaded with a certain material,\nand each material gives the weapon different properties (only when Gun is unlocked):\n-Titanium: Normal rifle-like bullet with fairly long range and high accuracy.\n\n-Copper: Machine gun which fires faster, but less accurate and shorter range.\n-Uranium: High-powered bullet with longer range and slow fire rate.\n\n-Explosives: Flak shell that bursts into fragments at the end of its range, or on\n\nimpact. This weapon is excellent vs. aircraft, but ineffective against most other targets,\nas the shell will only detonate if fired towards the sky. Flak Guns must be at least\n\n4 studs wide and 8 studs long to function.\n\n-Nitroglycerin: Shell that explodes on impact. Shell Guns must be at least 2 studs wide\nand 8 studs long to function.\n\nGuns are fired by signaling/clicking them, but need to be connected with an Ammo container.\n\nUses: Weapon\nRequires: Titanium, Magnesium, Charcoal, Sulfur, Ashes, Ice\nMalleability: Fair\n","balloon":"PART: BALLOON\nThe Balloon is a hydrogen balloon capable of flight.\n\nBalloons must be controlled with Controllers. The Controller sets the Balloon's\nheight. Lifting power is reduced as height increases.\n\nThe resiliency of Balloons is affected by their size; small Balloons will be easily\ndestroyed, but large Balloons can withstand attack by most weapons for a long time.\nDamage will cause gas to leak out and cause the balloon to lose buoyancy over time.\nSwords will deal substantial damage to Balloons, especially on the ground.\n\nUses: Aircraft, Weapon\nRequires: Wood, Stone, Oil, Ashes, Leaves\nMalleability: Extreme\n","enricheduranium":"PART: ENRICHEDURANIUM\n\nEnrichedUranium is an extremely radioactive material used to create nuclear Warheads. The\nonly way to produce it is enrichment of regular Uranium using a Lab.\n\nUses: Manufacturing, Defense\nObtained: Lab\nMalleability: Poor\n","sportball":"TOOL: SPORTBALL\n\nSportBalls have different characteristics based on the ammo type used. Once selected, they\ncannot be deselected again without dropping them. Click in any direction to throw the\nSportBall, which will be removed from your inventory.\n\nPlayers can steal a SportBall held by another player, and deflect them using a Pitchfork.\nSportBall Ammunitions (load an ammo by using the Ammo button in Produce GUI):\n-Default: Volleyball, gently thrown.\n\n-Leaves: Basketball, bouncy.\n\n-Cotton: Baseball, thrown with a shallow arc.\n\n-Rubber: Dodgeball, damages and knocks down players when caught at speed.\n\n-Stone: Bowling ball, damages players when caught at speed, heavy and non-bouncy.\n\n-Sand: Sandbag, resists bouncing or rolling.\n\nUses: Fun, Weapon\nRequires: Rubber\n","catapult":"PART: CATAPULT\nA Catapult is a primitive weapon able to use any kind of part as ammo.\n\nInsert a part into the Catapult to load it; it must be small enough to fit inside. When\nloaded, fire by clicking or signaling. The inserted part will be hurled out with a force\nbased on the Catapult's length, and the projectile is able to damage parts depending on\nits own strength and mass. The thrown part is not destroyed and can be picked up again\nafter a short duration. Reloading is faster with smaller projectiles.\n\nMost parts requiring power will be temporarily powered while hurled. Oil will be set on\nfire when launched.\n\nUses: Weapon, Part Transportation\nRequires: Wood, Cotton\nMalleability: Fair\n","gel":"PART: GEL\n\nGel is a translucent, weak substance that has the property of extinguishing fires in\nattached parts. Extinguishing a fire has a high chance to consume the Gel each time,\nand it cannot protect Ice from melting or bombs from detonating.\n\nDespite the low strength, Gel can also be useful in construction because of it's high\nmalleability, low friction, and bounciness. Gel is also immune to Acid.\n\nLike Rubber, Gel causes no fall damage when landed on.\nUses: Construction, Fireproofing\n\nRequires: Ashes, Wood, Sulfur, Ice\nMalleability: Good\n","lirvanite":"PART: LIRVANITE\n\nLirvanite is a shiny crystalloid found only on other planets. It is unique, valuable,\nrelatively light, and as strong as Diamond. Lirvanite is the only space material that\ndoesn't require refining.\n\nUses: Manufacturing, Construction\nObtained: Mining, found on few planets\nMalleability: Good\n","container":"PART: CONTAINER\n\nA Container holds certain substances, and prevents liquids/gases from evaporating.\n\nWhen connected to Pipe or Valve, it will transfer the substance through it. Faucets (which\nare connected directly or through Pipes) will release liquids and gases from the Container.\nItem and model recipes can directly use substances in nearby Containers.\n\nContainers are also used for supplying ammunition to Cannons, Guns, and Launchers. They\nwill auto-configure to the ammo type of the first connected weapon, and cannot be mixed.\n\nContainers can hold Water, Oil, Acid, Nitroglycerin, LiquidNitrogen, ProtaliumOxide,\nToxin, Steam, Ammo, and Coal.\n\nCertain substances give the Container special properties:\n\n-Steam: Exerts a weak force on the Faucet it comes out of.\n\n-Nitroglycerin: The Container will explode from high amounts of shock.\n\n-ProtaliumOxide: Re-energizes connected PowerCells (1000 energy for 1 ProtaliumOxide).\n-Acid: Instantly gets rid of all unconnected parts that the Container touches.\n\nDipping an empty Container underwater for long enough will fill the Container with Water.\n\nUses: Ammo Storage, Fuel Tank, Liquid Storage\nRequires: lron, Leaves\n\nMalleability: Fair\n\nLiquid Storage: Size x 12.5\n","actuator":"PART: ACTUATOR\nThe Actuator is used in pairs for linear extension/retraction.\n\nTwo Actuators will connect if an unpowered Actuator is attached (preferrably facing the\nsame direction) to a powered one. After connection, the Actuator pair will extend while\nthe one that was originally powered is powered, and retract when it is not.\n\nWider Actuators produce more lifting power.\n\nUse the Hammer's Config Tool to set the Actuator's length and speed.\n\nUses: Linear Motion\n\nRequires: Iron, Aluminium, Titanium, Oil\nMalleability: none\n\nPower Usage: 3.3 energy/second\n","ashes":"PART: ASHES\n\nAshes are created when most substances burn. Oil and small parts do not produce Ashes.\nTheir only practical use is ingredients in Plastic and Goo.\n\nUses: Creating Plastic and Goo\nObtained: Burning parts\nMalleability: none\n","inductor":"PART: INDUCTOR\n\nInductors transfer energy to nearby PowerCells wirelessly. The range is determined by\nlength (10 studs per stud long, up to 100), and transfer rate is determined by width.\n\nUses: Circuit Transfers, Charging Stations\nRequires: Aluminium, Silicon, Copper, Quartz\nMalleability: Fair\n\nPower Usage: Variable\n","forcefield":"PART: FORCEFIELD\n\nThe ForceField is a special part that can block almost any kind of attack while powered.\nIt uses up large amounts of energy, and becomes non-colliding when power is turned off.\n\nBecause it uses so much energy, only ProtonCells or powerful generators are suited to\nsustaining a ForceField for reasonable amounts of time.\n\nUses: Advanced Armor, Gates, Shields\n\nRequires: Lirvanite, Abantium, Silicon, Copper, Gold, Uranium\nMalleability: Extreme\n\nPower Usage: 16.6 power/second\n","propeller":"PART: PROPELLER\n\nPropellers produce a forward force the faster they are spun. They are primarily used on\nairplanes or seacraft, connected to some form of engine/motor. Propellers do not work in\nspace, and lose power at high altitudes. If underwater, they have a lower maximum speed\nbut a much higher force.\n\nPropellers cannot be effectively driven by DriveBoxes, so attach directly to an engine.\nUses: Aircraft, Boats, Submarines\n\nRequires: Iron, Flint, Oil\nMalleability: none\n","deuteriumcap":"PART: DeuteriumCap\n\nDeuteriumCaps facilitate thermonuclear capability for an attached Warhead when used in\ncombination with supercritical Plutonium.\n\nA more benign use for DeuteriumCaps is that any currently attached parts are rendered immune\nto Acid or Acid-releasing weapon. Parts already being dissolved can also be cured by attaching\na DeuteriumCap.\n\nUses: Thermonuclear Weapons, Acid Resistance\nRequires: Water, Water, Water, Water, Water, Water, Water, Water, Magnesium, Neodymium\nMalleability: none\n","asphalt":"PART: ASPHALT\n\nAsphalt is a heavy, medium-strength part with high friction and malleability. It can be used\nas a building material, or more commonly long roads.\n\nWhen used as a road (thickness of 1 stud and attached to ground), Asphalt gains a large\nstrength bonus and is not easily destroyed.\n\nUses: Roads, Construction\nRequires: Oil, Flint, Stone\nMalleability: Extreme\n","inverter":"PART: INVERTER\n\nInverters act as wires that automatically switch to other connected energy cells if\nthe current one runs out of power, to enable use of multiple cells on one circuit.\n\nWhen an Inverter is connected to ground, it will transmit energy through the earth to\nany Wires connected to the same ground section. This is useful to create large power\ngrids without many wires.\n\nUses: Increased Energy Storage, Ground Power\nRequires: Copper, lron, Quartz\nMalleability: Good\n","ammo":"SUBSTANCE: AMMO\n\nAmmo is a supply of ammunition for Guns, Launchers, Cannons, and ActiveDefense. In its part form\nexplodes when set on fire and despawns after 5 minutes. Insert the Ammo part into a Container to p!\nit indefinitely.\n\nAs a solid substance, Ammo can be transferred through Pipes, Controllers, Valves, and Fuel Cans. H\nit cannot be emitted by a Faucet.\n\nUses: Weapon Ammunition Supply\nRequires: Copper, Gunpowder\nMalleability: none\n","turboshaft":"PART: TURBOSHAFT\n\nTurboshafts are identical to Turbofans except that they spin a hinge and can be linked with\nrods (using the Hammer's Link tool) unlike the Turbofan, but produce no thrust. They also do\nnot require the intake to be uncovered, and are slightly quieter.\n\nTurboshafts that take damage can be repaired using the Wrench tool.\n\nLinking with a RodConstraint to a DriveBox creates a driveshaft that can turn the\nDriveBox's hinge.\n\nUses: Vehicles\nRequires: Aluminium, Titanium, Oil, lron, Magnesium, Jade\nMalleability: Fair\n","levitator":"PART: LEVITATOR\nThe Levitator is a hovering part that can be used for amphibious vehicles.\n\nPowering the Levitator will cause it to hover above the ground (make sure the decal is\npointing upwards), with a height based on its size. It can hover over water or any\nterrain, and when used properly, can even ascend the steepest of slopes and straight\nover walls/mountains.\n\nUses: Vehicles, Turrets\n\nRequires: Gold, Uranium, Magnesium, Titanium, Jade, Gas\nMalleability: Fair\n\nPower Usage: 5 energy/second\n","glowtube":"PART: GLOWTUBE\n\nGlowTubes are radioluminescent light sources that require no energy to operate but cannot be\ntoggled. They do not emit a harmful level of radiation.\n\nA GlowTube only produces usable light if more than 1 stud wide.\nUses: Lighting, Markers, Decoration\n\nRequires: Uranium, Glass\nMalleability: Fair\n","templates":"PARTS: TEMPLATES\n\nThere are six template parts that can be used to make other materials into different\nshapes and uses. Attach a template part to a material for a few seconds to make the\ntemplate into that material, if compatible. Template parts save their material, and\n\ndo not corrode in storms.\n\nParts:\n\n-WedgeTemplate: Wedge shape.\n\n-BallTemplate: Ball shape.\n\n-WheelTemplate: Hinged wheel shape. Rubber gives greatly increased friction.\n-BladeTemplate: Rounded shape that can break parts depending on its speed and material\nstrength. Stronger blades harvest plants and mine surface ores, but can deplete the mine\nwhen used too often. Blades cannot damage parts locked by the same player.\n-DoorTemplate: Signal to open/close. Can be locked with a ComboLock.\n\n-Cornerfemplate: Corner wedge shape.\n\nLIST OF TEMPLATE MATERIALS:\n\nFlubber, SeaAlloy, Lexan, Aluminium, Copper, Gold, lron, Magnesium, Titanium, Eridanium,\nAbantium, Wood, Rubber, Wire, Pipe, SignalWire, Plastic, Glass, TintedGlass, Arcolantium,\nIce, Quartz, Stone, Amethyst, Brick, Concrete, CarbonFiber, Ceramic, Y, Foam, Uranium, Gel,\nJade, ZapWire, Lirvanite, Neodymium, BioWall, OrganicMatter, Silicon, Switch, SignalSwitch,\nTouch Trigger, Valve, Zaktralia, Button, PsiButton\n\nUses: Wheels, Wedges, Blades, Spheres, Doors, Corner Wedges\nRequires: Stone\nMalleability: Material-dependent\n","steam":"SUBSTANCE: STEAM\n\nSteam is produced when a Container of Water is boiled using a Reactor, Firebox, or burning parts. It\nis used as the \"fuel\" for SteamEngines.\n\nWhen released through a Faucet, a backward force is exerted from the pressure of the Steam.\n\nAs a gaseous substance, Steam evaporates unless kept in a Container, and can be transferred\nthrough Pipes, Controllers, Valves, and Faucets. However, Steam cannot be collected using a Fuel C:\n\nUses: Steam Power, Water Production\nObtained: Geysers, Derrick drilling, Boiling Containers of Water\nMalleability: none\n","empbomb":"PART: EMPBOMB\n\nAn EMPBomb is a special explosive device that is harmless to parts (except for damaged/\ncorroded parts) and weak against players, but drains and disables any power source in\nits radius for two minutes. Unlike most explosions, this effect is not blocked by walls,\nthough the effective radius is small.\n\nEMPBomb explosions are also powerful against EnergyShields and can disrupt cloaks.\n\nUses: Weapon\nRequires: Aluminium, Copper, Gold, Jade\nMalleability: none\n","leaves":"PART: LEAVES\n\nLeaves are piles of leaves left from cut-down trees. They can be burned for\nshort but intense heat, and are used to manufacture rubber.\n\nUses: Roofing, Fires, Horse Food\nObtained: Trees\nMalleability: none\n","camera":"PART: CAMERA\n\nA Camera allows remote viewing from a Television.\n\nUse the Hammer's Config Tool to set the ID of a Television and a Camera to the\nsame number (the Camera must be set first). When the Television is powered,\nclicking on it will show the view from the camera.\n\nWhen a Camera is in space, attaching Rubies to it will turn the Camera into a\n\ntelescope and can see much farther than normally possible. When viewing the telescope\nCamera, press | and O to zoom in and out (default is zoomed all the way in). The maximum\nzoom level depends on the amount of Rubies attached to the Camera.\n\nUses: Security, Remote Control, TV Stations\nRequires: Glass, Aluminium, Silicon\nMalleability: none\n","parachutepack":"PART: PARACHUTEPACK\n\nA ParachutePack is a wearable jacket which deploys a parachute when signaled, slowing the\nfall of whatever is attached. While being worn by a player, it will instead deploy when\nthe player falls from a harmful height. It cannot be worn while welded to a part.\n\nUses: Skydiving, Cargo Delivery, Target Practice, Emergency Systems\nRequires: Cotton, Oil, Ruby\nMalleability: none\n","plasmapistol":"TOOL: PLASMA PISTOL\n\nThe Plasma Pistol fires spheres of charged plasma, good against parts, and can stun players\nfor along length of time.\n\nPlasma Pistol shots dissipate, meaning that they lose power with distance.\n\nPlasma Pistol Ammunitions (load an ammo by using the Ammo button in Produce GUI):\n-Default: Plasma shots that are good against parts, and stun players for a long time.\n-Jade: Heals, removes stun, and decreases reloading time of other players. Signals parts.\n-EnergyBomb: Vaporizes most parts on contact, and can pierce players. Slower reload.\nUses: Weapon\n\nRequires: Abantium, Abantium, ZapWire, Diamond, Uranium, Magnesium\n\nRange: Medium\n\nDamage: Medium\nFiring Rate: Fast\n","hydrogenerator":"PART: HYDROGENERATOR\n\nHydroGenerators generate energy when placed in water with at least 200 studs of clear space\nin front and behind, and not over deep ocean.\n\nThough difficult to set up initially, HydroGenerators provide a substantial amount of power,\ndo not require fuel, and operate 24/7 regardless of sunlight or wind.\n\nUses: Power Generation\n\nRequires: Copper, Iron, Aluminium, Oil\nMalleability: none\n\nPower Generation: 15/second\n","cmos":"PART: CMOS\n\nA CMOS is an advanced electronic part which performs operations on signal data. Signals are\ninputted through Polysilicon (Mode 0 is Signal A, Mode 1 is Signal B, Mode 2 is Signal C)\n\nand outputted either directly, or through Mode 3 Polysilicon when an operation is FALSE.\nSignal A can also be received from another CMOS which is directly connected, allowing chains\nof CMOSes for multiple operations.\n\nThe Hammer's Adjust tool sets the operation data (explained below) and the signal tolerance,\nwhich determines the allowed time in seconds between the A and B signal if applicable.\nIf Tolerance is 0, the CMOS will wait forever until the other signal is received.\n\nFUNCTION\n\nOperation data is in this format: OPERATION; VAR1;VAR2;VAR3. Each entry is seperated\nby semicolons ‘;', how many VAR slots depends on the operation. For each variable,\nenter either data or a two-digit code (Signal A, B, or C)(Entry #), such as ‘A'.\n\n\":\" changes to \";\" in all variables.\n\nExamples: +;A1;B1, \\;C1;100, RAND, PACKET;A1;B1;C1, >;A2;2, =;B2;Hello, SIN;C2\nACTION OPERATIONS (with number of variables)\n\nRAND: (none) Outputs a random number.\n\nABS, ACOS, ASIN, ATAN, COS, COSH, DEG, RAD, ROUND, SIN, SINH, TAN, TANH: (1) C math.\nREMOVE: (1) Outputs the variable with the last list entry deleted.\n\nINSERT: (2) Outputs variable 2 attached to variable 1 as a list entry.\n\nTIMEOUT: (2) Outputs variable 2 when the last input was [var 1] seconds ago.\n\n+,-,* or’, \\, *, %: (2) Outputs the result of the respective math operation.\n\n], [: (2) Outputs the greater/lesser of the two number variables.\n\nATAN2: (2) Performs atan2 on the two variables.\n\nAFFIX: (2) Affixes a number on the end of a string. (Hello + 123 = Hello123)\n\nMAGNITUDE: (3) Outputs distance of a vector.\n\nMYMAGNITUDE: (3) Outputs distance of a vector from the CMOS's position.\n\nUNIT: (3) Outputs a normed vector.\n\nANGLEH: (3) Outputs the horizontal angle of a vector from the CMOS's position and rotation.\nANGLEV: (3) Outputs the vertical angle of a vector from the CMOS's position only.\n\nPACKET: (1 to 4) Outputs each variable as the respective list entry.\n\nCOLOR: (none or 3) Colors Light/SpotLights/ZapWires/LaserTargeters/Glow Tubes/CMOS/LCD that\nareconnected. If variables are specified (0-255), they will determine color (otherwise,\n\ncolor of the CMOS is used instead).\n\nCOMPARATIVE OPERATIONS (two variables required)\n\nThese output the first variable directly if TRUE, through Mode 3 Polysilicon if FALSE.\n>, <: TRUE if first variable is greater than/less than the second.\n\n=, !: TRUE if first variable is equal to/not equal to the second. Use keyword STRING\nor NUMBER on the second variable to check the type, é.g. =;A1;STRING.\n\nC, N: TRUE if first variable contains/does not contain the second.\n\nUses: Color Changing, Calculations\nRequires: Silicon, Gold\nMalleability: Fair\n","explosives":"PART: EXPLOSIVES\n\nExplosives is a powerful bomb that can be resized to modify the explosion power.\nIt is activated by signaling, or setting on fire.\n\nExplosives explosions cannot travel through parts. Make sure there is a clear, open\npath between the bomb and the target when used.\n\nCharcoal attached to Explosives will create a firebomb, and Blades attached will briefly\nincrease the attack power of the Blades, for a fragmentation bomb.\n\nUses: Weapons\nRequires: Charcoal, Sulfur, Ashes, Wood, Sand\n","cloakingdevice":"PART: CLOAKINGDEVICE\n\nThe CloakingDevice, when powered, renders the machine connected to it invisible to sight,\nRadars, and Seekers.\n\nCloakingDevices cannot cloak parts directly or indirectly connected to ground. CloakingDevices\nalso cannot cloak objects that are more than 120 parts; however, they will be camoflauged for\nspace.\n\nUses: Stealth\n\nRequires: Gold, Lirvanite, Eridanium, Protalium, Silicon, Ruby\nMalleability: none\n\nPower Usage: 10 energy/second\n","button":"PART: BUTTON\n\nA Button sends a signal to connected parts when clicked. When clicked directly, the data\nsent will be the name of the player who clicked. Mode 5 Sensors can also activate Buttons,\nbut the Button activated will not activate connected Sensors.\n\nConfigure the Button to set a keybind. If set to a keybind, the button will not be\n\nclickable: instead, attach to a Seat or SteeringSeat, and any player who sits in the seat\n\nand presses the keybind will signal the button. Most alphanumeric, system, and arrow keys\ncan be used.\n\nNOTE: When setting keybinds, you must spell out any non-letter characters in words.\nExamples: 8 = eight, Enter = return, Ctrl = leftcontrol or rightcontrol, ; = semicolon.\nAny unrecognized input will show as “unknown”,\n\nUses: Controls\nRequires: Copper\nMalleability: Fair\n","rifle":"TOOL: RIFLE\n\nThe Rifle fires a powerful, long-range tracefire bullet that does bonus damage on headshot.\nThe bullet loses too much velocity after 600 studs to damage parts.\n\nRifle Ammunitions (load an ammo by using the Ammo button in Produce GUI):\n-Default: Long-range bullet, also good against parts.\n\n-Gold: Instant reload, slightly higher part damage, but shots cost 40 credits each.\n-TimeMachine: Switches player control. Does no damage and has 60 second reload.\nUses: Weapon\n\nRequires: lron, Titanium, Magnesium, Explosives, Gunpowder, Jade\n\nRange: Long\n\nDamage: High\nFiring Rate: Medium\n","plant":"PART: PLANT\n\nPlants grow and replicate with different effects and uses depending on their DNA. Some may\nbe harvested for materials, and most will have a chance to drop a seed when harvested.\n\nCotton-bearing Plants are always scattered throughout the map. They do not actively replicate\nunless seeds are harvested and replanted, but do respawn after being harvested.\n\nUses: Profit, Power Generation, Offense, Defense\nObtained: BioLab, or harvesting for seeds\nMalleability: none\n","exoticmatter":"PART: EXOTICMATTER\n\nExoticMatter is an extremely rare substance that has negative mass, and falls upward\ninstead of down. ExoticMatter also is transparent and has very high strength and\nmalleability.\n\nThe only way to produce ExoticMatter is by adding LiquidNitrogen to ProtaliumOxide.\nIn this reaction, a powerful explosion will be created, which has a chance to fling a\nvery small piece of ExoticMatter in a random direction. ExoticMatter is very difficult\n\nto obtain because of the massive explosion range, the low chance for it to be spawned,\nand the fact that it can fall into the sky.\n\nUses: Construction,\nObtained: LiquidNitrogen + ProtaliumOxide explosions\nMalleability: Extreme\n","cleats":"PART: CLEATS\n\nCleats are parts covered in small spikes that have the most friction of any part. They are\nuseful for applications where strong grip is required, such as in the feet of mech legs.\n\nUses: Mech Legs, Climbing Machines, Brakes\nRequires: Titanium, Jade\nMalleability: Poor\n","toxin":"SUBSTANCE: TOXIN\nToxin is a poisonous liquid which splatters violently on contact with non-terrain parts.\n\nAs a liquid substance, Toxin evaporates unless kept in a Container, and can be transferred\nthrough Pipes, Controllers, Valves, Fuel Cans, and Faucets.\n\nUses: Weapon\nObtained: Toxic plants, Empty Container attached to Container of Gas on a powered Biolab\nMalleability: none\n","scattergun":"TOOL: SCATTERGUN\n\nThe Scattergun is a variant of the Musket that fires a spray of lower-damage bullets.\nScattergun Ammunitions (load an ammo by using the Ammo button in Produce GUI):\n-Default: Bullet spread good for stunning players, and can instantly kill at close range.\n-Sulfur: Heated shot with less range and stun, but has a chance to set targets on fire.\n-Gas: High-powered triple shot that is good against vehicles, and fires faster.\n-Aluminium: Sonic wave. Destroys Rockets, Missiles, Anchors, and Cannon/Launcher projectiles.\nUses: Weapon\n\nRequires: Iron, lron, Flint, Wood, Gunpowder\nRange: Short\n\nDamage: Medium\nFiring Rate: Medium\n","neodymium":"PART: NEODYMIUM\nNeodymium is a rare-earth metal that cannot be duplicated.\nUses: Manufacturing\n\nObtained: Subsoil (Derrick)\nMalleability: Poor\n","selfdestruct":"PART: SELFDESTRUCT\n\nA SelfDestruct is an explosive device which destroys the entire model it is attached to, if\n\nit is owned by the same player as the model. Parts of almost any strength, including Eridanium,\nare affected and 90% are fried, rendering them useless. This makes the SelfDestruct useful\n\nfor preventing a vehicle from falling into enemy hands. The fried debris will despawn, making\ncleanup easier.\n\nBecause of the short delay between signaling and detonation, SelfDestructs can also be used\nto create a powerful, though expensive, cluster bomb.\n\nSignal or set on fire to activate. Activation will not occur if the SelfDestruct is indirectly\nor directly connected to ground.\n\nUses: Capture Prevention, Traps, Cluster Bombs, Cleanup\nRequires: Charcoal, Sulfur, Ashes, Wood, Sand, Silicon, Gold\nMalleability: none\n","liquidnitrogen":"SUBSTANCE: LIQUIDNITROGEN\n\nLiquidNitrogen is an extremely cold liquid which permanently freezes many parts to Ice on\ncontact. Pouring LiquidNitrogen into a Reactor rapidly cools it.\n\nIf LiquidNitrogen touches ProtaliumOxide, an explosive reaction occurs producing ExoticMatter.\n\nAs a liquid substance, LiquidNitrogen evaporates unless kept in a Container, and can be\ntransferred through Pipes, Controllers, Valves, Fuel Cans, and Faucets.\n\nUses: ExoticMatter Production, Profit, Weapon\nObtained: Empty Container attached to a powered Cooler on Earth\nMalleability: none\n","solarpanel":"PART: SOLARPANEL\n\nA SolarPanel is a type of generator that uses sunlight to function. They do not work during\nnighttime or storms, and power output is reduced or eliminated if the panel is blocked by\nnon-transparent objects.\n\nNOTE:\n\nSolarPanels may not function if touching other SolarPanels.\n\nWhen wired to a PowerCell, the SolarPanel will recharge the cell depending on the panel's\nsize. SolarPanels are expensive, weak, and space-consuming, but are quick to set up and\ndon't require fuel.\n\nIn space, SolarPanels will cease to function when too far away from Earth unless near a star.\n\nUses: Power Generation\n\nRequires: Silicon, Glass, Quartz, Gold\n\nMalleability: Excellent\n\nPower Generation: 18.1 energy/second at maximum size\n","pulsedrive":"PART: PULSEDRIVE\n\nA PulseDrive is a type of spaceship engine, converting energy to force.\n\nThe PulseDrive offers a good balance of speed, weight capacity, and efficiency, while also\nemitting no particle trails and little noise but has very slow acceleration. Maximum velocity\nvaries greatly while operating.\n\nTo make the PulseDrive hover when deactivated instead of falling, attach an Anchor to it and\nclick the Anchor once.\n\nUses: Spacecraft\n\nRequires: Copper, Lirvanite, Amethyst\nMalleability: none\n\nPower Usage: 37.8 energy/second at full power\n","coal":"SUBSTANCE: COAL\n\nCoal is a solid fossil fuel which burns for a very long time. It is excellent fuel for Fireboxes and the\nonly fuel for PowerPlants.\n\nAs a solid substance, Coal can be transferred through Pipes, Controllers, Valves, and Fuel Cans. Hov\nit cannot be emitted by a Faucet.\n\nUses: Fuel\nObtained: Coal Mines, Derrick drilling\nMalleability: none\n","endgame":"PART: ENDGAME\n\nWhen clicked on by 16 different players, the Endgame detonates, blowing up the Earth. Shortly\nafterward, the server will restart with a new world seed.\n\nIt cannot be detonated in space, and clears any entries if not clicked for 60 seconds.\nUses: Self Explanitory\n\nRequires: Warhead, Warhead, Warhead, Warhead, DeuteriumCap, Plutonium, Titanium, Amethyst, Ashes\nMalleability: none\n","lamp":"PART: LAMP\nA Lamp is a dim but infinite light source that can be clicked to light or put out.\n\nLamps will go out if there are no players nearby for a certain amount of time, but\nthey can easily be re-lit when needed.\n\nUses: Lighting\nRequires: Oil, Glass\nMalleability: Poor\n","dish":"PART: DISH\n\nA Dish performs a wide variety of information collecting or other functions from a\nvirtually unlimited distance. Information is outputted through Mode 3 Polysilicon.\n\nMost Dish operations are applied in an area determined by the Dish's direction, range\nsetting (distance from Dish), and radius setting (distance from the scan point). Signal\nthe Dish with all three settings in a list (mode;range;radius) to perform an operation,\nor alternatively, use any non-list signal to operate with the default settings which are\nset by the Hammer's Config tool.\n\nSet the range to 0 to target areas at sea level only, which is most useful when the Dish is\nmounted on a satellite above Earth.\n\nThe Dish must be linked to a non-full PowerCell for mode 11, and any energy cell for mode 0.\nLIST OF DISH MODES\n\n0: Emits a wave which jams Antennas, Radios, and Radars. Range/radius settings not used.\n1: Outputs the scan point.\n\n2: Outputs the total number of parts in the area.\n\n3: Outputs a list of players and bots in the area.\n\n4: Outputs a list of held tools in the area, with the user's name preceding each.\n\n5: Chance to output active signal data in the area.\n\n6: Outputs a rough list of entire model positions. Each three entries is a vector.\n\n7: Same as 6, but positions are relative to the scan point.\n\n8: Outputs significant heat signatures in the area. Each three entries is a vector.\n\n9: Same as 8, but positions are relative to the scan point.\n\n10: Outputs ionizing radiation signatures in the area. Each three entries is a vector.\n11: Same as 10, but positions are relative to the scan point.\n\n12: Saps energy from a PowerCell in the area. Outputs charge level of target.\n\n13: Outputs a scaled 6x6 map of terrain colors. Y increases every 6 entries.\n\n14: Outputs a scaled 6x6 map of terrain and part colors. Y increases every 6 entries.\n15: Outputs a scaled 6x6 map of terrain altitude. Y increases every 6 entries.\n\nPart Type: Outputs how many parts of a specific type are in the area.\n\nSome outputs are best read using a Computer. The following is a sample YewScript program\nwhich can be used for modes 13 - 15, sent to the Computer through Mode 0 Polysilicon.\n\nprint\nA=0\nB=0\n\nboxA'0'B'30'30\" ‘1001\nA+1\n\nboxA'32'B'30°30\" ‘1001\nA+1\n\nboxA'64'B'30°30\" ‘1001\nA+1\n\nboxA'96'B'30°30\" ‘1001\nA+1\n\nboxA'128'B'30'30\" ‘1001\nA+1\n\nboxA'160'°B'30°30\" ‘1001\nifA<36\n\nB+32\n\ngoto4\n\nend\n\nA=Buffer'0\n\nifA!List\n\ngoto20\n\nend\n\nC=A'B\n\nchangeB’ '* ' ‘ 'C (Use \"changeB' ' * * 'C\" for mode 15)\nifB<36\n\ngoto25\n\nend\n\ngoto20\n\nUses: Area Scanning, Wireless Jamming, Energy Transfer\n\nRequires: Iron, Silicon, Titanium, Diamond, Quartz\n\nMalleability: None\n\nPower Usage: 100 per jamming wave, -20/pulse for power sap, otherwise none\n","lab":"PART: LAB\n\nA Lab is a part used to combine and modify other parts in various ways. Labs are self-\npowered and do not require energy.\n\nOn Earth, Labs can be used to produce experimental weapons with wildly varying stats and\nabilities. Two Cannons must be inserted, which the Lab will then process for a short period\n\nof time, after which there is a very small chance to generate an Experimental Weapon. These\nweapons do not require any ammo containers.\n\nIf two pieces of Uranium are inserted, the Lab enters centrifuge mode. To begin the enrichment\nprocess, three different players must click on the Lab. After two minutes of operation, an\nEnrichedUranium piece will be produced. This does not work in space or underwater.\n\nLabs are also capable of combining the properties of two different parts, though this\n\nability only works in space. To create Hybrids, insert two different parts (besides other\nhybrids, and Uranium). The Lab will activate, process the parts for a time, and produce a Hybrid.\nThe resulting part is combined depending on the order the parts were inserted.\n\nUses: Experimental Weapons, Enriching Uranium, Part Hybrids\nRequires: Silicon, Copper, Gold, Ruby, Sulfur, Neodymium\nMalleability: none\n","y":"PART: Y\n\nY is an extremely valuable material which is both the lightest and most resizable in the\ngame, becoming entirely massless when connected to other parts. It also has similar\nstrength to Eridanium, and does not cast shadows.\n\nY's most unique property is the inability to activate any kind of touch detection. This\nmeans that it will be ignored entirely by projectiles, TouchTriggers, Foam, Crates, etc.\n\nUses: Construction, Superweapons, Anti-Trigger\nObtained: Dropping ExoticMatter downward through a star\nMalleability: Insane\n","wire":"PART: WIRE\n\nWires transmit energy between energy cells and loads, such as Lights or Heaters.\nWhen connected to ground on Earth, they can recieve energy from Inverters on the same\npiece of terrain.\n\nUses: Power Transmission\nRequires: Copper\nMalleability: Excellent\n","wing":"PART: WING\n\nThe Wing is a more advanced part for aircraft. Moving it in the direction of the decal\nwill lift it upwards; the force is determined by the Wing's forward speed and size.\nPitch the wing up and down to control vertical speed.\n\nNOTE:\n\nWings may not function if touching other Wings.\n\nUses: Aircraft\nRequires: Aluminium, Magnesium\nMalleability: Good\n","sulfur":"PART: SULFUR\nSulfur is a substance neccesary for producing many items.\nIt emits a blue flame when burned.\nUses: Manufacturing\n\nObtained: Sulfur Ore Mines\nMalleability: none\n","filler":"PART: FILLER\n\nWhile powered, Fillers automatically link and transfer substances flowing into them to\nnearby Containers, similar to electrical Inductors. The range is determined by width\n(5 studs per stud long, up to 50), and transfer rate is determined by depth.\n\nUnlike Inductors, Fillers can only transfer to one Container at a time. Ammo Fillers will\ntransfer to the largest Container first, and vice versa for liquid or gas Fillers. They\ncan only transfer to Containers which are empty or containing the same substance.\n\nUses: Fuel Stations, Ammo Stations\nRequires: Titanium, Silicon, lron, Quartz\nMalleability: Fair\n\nPower Usage: 6/second\n","seeker":"PART: SEEKER\n\nA Seeker is a motorized targeting computer. While powered, it will read data from a\nconnected MemoryChip and rotate to face any target found and output data signals.\n(Output format: TargetX; TargetY; TargetZ; Distance)\n\nThe MemoryChip data must consist of a list of targets and/or tags seperated by \";\".\nExamples: Pawn;Not;Automaton, 2500;200;0;ScanAvoid;2DRotate, Resource; Jade.\n\nThe first entry must always be one of the following tags:\n\n-[(num];[num];[num]: Targets an X;Y;Z position (uses the first THREE entries).\n\n-Pawn: Targets players by name, or bots by class (Automaton, Rogue, etc.)\n-EnemyPawn: Targets players/bots on enemy team in events. Does not use a target list.\n-Part: Targets parts by name (Wood, Seeker, Abantium, etc.)\n\n-Resource: Targets terrain objects (can use \"All\").\n\n-Roam: Constantly points in random directions - does not use entries.\n\nResources that can be detected: Tree, Fumarole, Crystal, Cactus, Fountain, Rocks, Spring,\nGeyser, Volcano, and surface ore types (such as Copper, Jade, Coal, etc).\n\nOther entries must be either targets (bot classes/player names) or these modifiers:\n\n-Not: Inverses the list; targets items of the same category that are NOT listed.\n-Min[num] or Max[num]: Only scans for targets more/less than [num] studs away.\n-NoRotate: Disables rotation, so that the Seeker can be used for signaling only.\n-2DRotate: Rotates only horizontally.\n\n-NoAbove or NoBelow: Does not detect targets above/below the seeker.\n-Deflect[num]: Represents projectile speed for improved accuracy.\n\n-MinTrig[num] or MaxTrig[num]: Only signals if distance is more/less than [num] studs.\n-2DTrig: Height difference is ignored for MinTrig and MaxTrig.\n\n-PitchLimit[num]: Does not exceed [num] degrees in pitch under any circumstances.\n-TurnSpeed[num] Sets the maximum rate of rotation between 1-200. Default is 100.\n-Height[num]: When pointing, the Y coordinate will always be at [num] altitude.\n\nUses: Drones, Detectors, Resource Detectors, Autopilots, Turrets\nRequires: Copper, Quartz, Titanium, Gold, lron, Magnesium\nMalleability: none\n\nPower Usage: 1.5 energy/second\n","turbofan":"PART: TURBOFAN\n\nTurbofans provide thrust using a supply of Oil or Gas. Thrust and fuel usage are increased\nby size, and the front of the Turbofan must not be blocked by parts during operation.\n\nTurbofans that take damage can be repaired using the Wrench tool.\nUses: Vehicles\n\nRequires: Aluminium, Titanium, Oil, lron, Magnesium, Jade\nMalleability: Fair\n","foundation":"PART: FOUNDATION\n\nA Foundation is a form of concrete used as a stable platform to build on uneven terrain.\n\nWhen the Foundation is placed and clicked, it will flatten, anchor, and align itself with\nthe rest of the terrain. It is not recommended to rotate it along the horizontal axis or to\nresize the Y vector (height) since both of these will be reset.\n\nOnce placed, the Foundation cannot be moved without destroying it.\nUses: Construction\n\nRequires: Quartz, Stone, Sand\nMalleability: Excellent\n","truss":"PART: TRUSS\nA Truss is a truss of iron that can be climbed.\nUses: Ladders, Construction, Aircraft\n\nRequires: lron\nMalleability: Excellent\n","aluminium":"PART: ALUMINIUM\n\nAluminium is a lightweight, light grey metal acquired from Aluminium ore.\nIt is fairly weak, but is as light as Wood, and so a good material for aircraft and\nless-advanced spacecraft.\n\nUses: Aircraft, Spacecraft\nObtained: Subsoil (Derrick)\nMalleability: Good\n","blinkdisplacer":"TOOL: BLINKDISPLACER\n\nA BlinkDisplacer enables the user to rapidly teleport to random places nearby, to avoid\nincoming attacks. It cannot teleport through walls, and will make a lower-pitched sound\neach time a warp fails.\n\nUses: Dodging\nRequires: Aluminium, Ruby, Zaktralia, Gold\n","treads":"PART: TREADS\n\nTreads are a method of moving land vehicles. It is recommended that wedges are attached\nto the front and back (facing down) for better performance over rough terrain. The force\nof the Treads is determined by their surface area, and speed increases with height.\n\nTo use Treads, they must be linked by a RodConstraint (with the Hammer's Constraint tool)\nto an Engine, Motor or SteamEngine. They will operate at the speed of the engine they\nare connected to.\n\nTreads are slower and noisier than wheels, but they are stronger and can climb over obstacles\n(with Wedges attached) with superior traction.\n\nThe Hammer's Config Tool can change the direction of the Treads.\nUses: Machines, Vehicles\n\nRequires: Copper, lron, Titanium\nMalleability: Fair\n","grenade":"TOOL: GRENADE\n\nThe Grenade is a weapon that can be thrown and will explode after a short time.\nGrenade Ammunitions (load an ammo by using the Ammo button in Produce GUI):\n-Default: Standard grenade that can fling or destroy large groups of enemies.\n\n-Magnesium: Flash grenade that temporarily blinds enemies for several seconds. This is one\nof the only ranged weapons with a reload time independent of other weapons.\n\n-LiquidNitrogen: Freeze grenade that immobilizes players in ice chunks.\n\nUses: Weapon\n\nRequires: Gunpowder, Gunpowder, Gunpowder, Iron, Flint, Cloth\nRange: Short\n\nDamage: High\n\nFiring Rate: Slow\n","transformer":"PART: TRANSFORMER\nTransformers convert energy to constant signals.\n\nUses: Circuits, Automatic Weapons\nRequires: Copper, Oil\n\nMalleability: Poor\n\nPower Usage: 0.45 energy/second\n","trampoline":"PART: TRAMPOLINE\n\nTrampolines launch players and bots into the air when walked upon. The bounce height is\nincreased by making the Trampoline thicker (no further effect past 6 studs). They do not\nwork if any dimension is larger than 20.\n\nLike Rubber, Trampolines cause no fall damage when landed on.\nUses: Player Transport, Arenas\n\nRequires: Diamond, Leaves, Stone, Charcoal\nMalleability: Good\n","touchtrigger":"PART: TOUCHTRIGGER\n\nTouchtTriggers signal connected parts when touched by another object. The signal data will\nbe the name of the item touched, including players.\n\nUses: Activators, Traps\nRequires: Copper, Flint\nMalleability: Fair\n","bilgepump":"PART: BilgePump\n\nBilgePumps slowly drain water from any leaking Hulls or CrudeHulls on the same vehicle\nwhen powered. It will automatically turn on if flooding is detected.\n\nBilgePumps do not function underwater.\n\nUses: Countering Hull Flooding\nRequires: Copper, Magnesium\nMalleability: none\n\nPower Usage: 8/second\n","timemachine":"PART: TIMEMACHINE\nThe TimeMachine is a device used to travel in time in different ways.\n\nThere is a clock on the top that shows the current time of day, as well as two numbers:\n-Red Number: Current date. It shows the amount of time passed since the server began,\ntimes 5. Example: If the number is 24, 24 x 5= 120, meaning the server is 2 hours old.\n-Orange Number: Set date to travel to.\n\nTo set the date to travel to, click the buttons on the clock face. To activate the\nTimeMachine, make sure it isn't indirectly connected to terrain, and signal to activate\n(there cannot be another TimeMachine nearby).\n\nWhen activated, the TimeMachine will transport anything connected to it back in time\nto the set date. It has a cooldown time of 15 seconds after returning.\n\nThe TimeMachine creates a time ‘bubble’ to travel in, the radius of which is about 120\nstuds. Parts outside of the bubble will not be shown; so to view a certain area, you\nmust move the TimeMachine to that area.\n\nOnly parts and terrain of the past is shown. They cannot be edited. Also, when a\nTimeMachine travels back to the present, the time bubble collapses, destroying\nanyone and anything left inside.\n\nA TimeMachine can be made into a Temporal Bomb. See the Warhead page for details.\n\nUses: Time Travel, Clock\n\nRequires: Silicon, Protalium, Gold, Abantium, Titanium, Ruby\nMalleability: none\n\nPower Usage: 3000 per leap\n","thruster":"PART: THRUSTER\n\nThrusters glow and produce a force when powered, depending on the size.\nThrusters will cut out if they reach a certain speed.\n\nUses: Propulsion\n\nRequires: Gold, Gas, Titanium\n\nMalleability: Good\nPower Usage: 18 energy/second at maximum size\n","thermalgenerator":"PART: THERMALGENERATOR\n\nThe ThermalGenerator uses geothermal power to generate a reasonable amount of energy.\nTo operate, it must be slightly above sea level, and not be within 300 studs of any\nother ThermalGenerators.\n\nA ThermalGenerator will function if attached to an active volcano, no matter what.\n\nUses: Power Generation\n\nRequires: lron, Copper, Quartz, Ruby\nMalleability: none\n\nPower Generation: 4.5 energy/second\n","airshield":"PART: AIRSHIELD\n\nThe Airshield will convert energy into an invisible bubble of air 400 studs in diameter.\nThis ability is useless on the surface of Earth, but at high altitudes and in space, it\nallows you to survive without a spacesuit as long as it is powered. It does not block\ncosmic radiation however, so you will either have to have a SpaceSuit or an enclosed\nspaceship cabin as well.\n\nUses: Spacecraft\n\nRequires: Titanium, Gold, Charcoal\nMalleability: none\n\nPower Usage: 2.2 energy/second\n","derrick":"PART: DERRICK\nDerricks are drilling rigs used to identify and obtain resources deep underground.\n\nPower the Derrick and click (or use Mode 0 Polysilicon) to begin drilling into terrain. This\ncan be done straight downwards or even at an angle to access resources diagonally.\n\nIf the drilling process is completed successfully, an indicator will display what type of\nresource was found, if any, and the Derrick will signal non-Polysilicon parts accordingly.\nClick (or use Mode 0 Polysilicon) again to bring a piece of the material to the surface. Note\nthat doing this too often may temporarily deplete the resource, preventing it from being\nobtained until several minutes later. The Derrick does not need to remain powered while\nlinked to a resource spot, and will remain linked across server saves.\n\nNOTE: Mode 0 Polysilicon may only be used to mine 10 pieces at a time. After that, the Derrick\nneeds to be manually clicked to reset this limit.\n\nWater spots are only found on land, while Gas spots are only found in deep ocean.\n\nSteam resource spots indicate geothermal activity. A Derrick will generate power while\nlinked to underground Steam.\n\nAttaching a Container to a Derrick linked to Coal, Oil, Gas, or Water will slowly fill it\nwith said substance, requiring no power and never depleting the resource spot.\n\nUse Mode 1 Polysilicon (or right-click) to retract an extended Derrick drill.\n\nUses: Mining, Wells\n\nRequires: lron, Gold, Copper, Ice, Ruby, Oil, Sulfur, Acid\nMalleability: none\n\nPower Usage: 10/second\n\nGeothermal Power Generation: 12/second\n","sword":"TOOL: SWORD\n\nA Sword is a basic melee weapon that does much more damage than the default Fist.\nSwords can also be used to quickly slice apart Balloons and Sails.\n\nUses: Weapon\n\nRequires: lron, Quartz, Rubber\nRange: Melee\n\nDamage: High\n\nFiring Rate: Fast\n","switch":"PART: SWITCH\n\nA Switch controls the flow of energy. Clicking on it or activating attached Polysilicon\nwill turn it on or off.\n\nIn models, Switches are loaded inactive if their color is set to \"Really black”.\nUses: Indicators, Control\n\nRequires: Copper\nMalleability: Poor\n","windmill":"PART: WINDMILL\n\nWindmills turn depending on the ambient wind speed, and can generate electricity by attaching\ntheir hinge to a Wire. Turning speed increases at optimum altitudes, but decreases if there\nare nearby objects blocking the wind.\n\nUses: Power Generation, Torque Generation\nRequires: Iron, Cotton\n\nMalleability: none\n\nPower Generation: 0-10/second\n","rocket":"PART: ROCKET\n\nRockets are engines which produce thrust even in the absence of air. Their fuel consumption\ndepends on their altitude, with higher altitudes requiring less fuel.\n\nTo power a Rocket, it must be connected (directly, or with Pipe/Valve) to a Container\nfilled with fuel. Rockets can use three different fuels:\n\n-Oil: High fuel consumption and relatively slower, but with a decent amount of force.\n-LiquidNitrogen: Can accelerate to a very fast speed, but low force.\n-ProtaliumOxide: High force and extremely high speed, but fuel is expensive.\n\nUses: Propulsion\nRequires: Titanium, Aluminium\nMalleability: none\n","protoncell":"PART: PROTONCELL\n\nProtonCells provide power similar to regular PowerCells, except that they can only be\ncharged by inserting rods of Protalium, and hold up to 200,000 power (4 rods).\n\nUses: Energy Supply\n\nRequires: Diamond, Abantium, Eridanium, Gold, Neodymium\nMalleability: none\n\nPower Capacity: 200,000\n","mainspring":"PART: MAINSPRING\n\nMainspring are clockwork motors which can store rotational power.\n\nTo wind a Mainspring manually, touch and hold it with your character. When the sound\nceases, it will have reached maximum capacity. Mainsprings can store energy for 1\nminute per stud of width they are resized to, but the action will be slowed as the\nMainspring winds down.\n\nClick on the Mainspring or signal it using Polysilicon to toggle unwinding.\nAlternatively, an attached Engine or Motor can wind a Mainspring much faster.\n\nUses: Wind-Up\n\nRequires: Copper, Iron\nMalleability: none\n","stone":"PART: STONE\nStone is a boulder of stone acquired from terrain rocks.\nUses: Construction, Manufacturing\n\nObtained: Rock surfaces\nMalleability: Good\n","stinger":"TOOL: STINGER\n\nThe Stinger fires long-range energy beams which send shockwaves through conductive\nmaterials.\n\nStinger Ammunitions (load an ammo by using the Ammo button in Produce GUI):\n-Default: Triple-firing beams.\n\n-lonDrive: Chaos Beam that causes chain reactions between players.\n\n-Diamond: Flinger beam that flings objects to great distances.\n\nUses: Weapon\n\nRequires: Abantium, Jade, Lirvanite, Transformer, Gold\n\nRange: Long\n\nDamage: High\nFiring Rate: Fast\n","steamengine":"PART: STEAMENGINE\n\nA SteamEngine is the cheapest way to create strong rotational power.\n\nTo operate a SteamEngine, a container of Steam must be connected either directly or\nwith Pipe. To create Steam in a Container, fill the Container with Water, and attach\nthem to the Container to heat the Water into Steam. The time it takes to heat the\nWater depends on the total mass of the burning objects connected. Speed 1 is idle\nand does not transmit power to the hinge.\n\nParts attached to the hinge on the SteamEngine will spin at a speed that can be\nset with the Hammer's Config Tool, as well as the direction.\n\nLinking with a RodConstraint to a DriveBox creates a driveshaft that can turn the\nDriveBox's hinge.\n\nUses: Vehicles, Aircraft, Seacraft\nRequires: lron, Copper, Ruby\nMalleability: none\n\nSteam Usage: Variable\n","spotlight":"PART: SPOTLIGHT\n\nA SpotLight is an electric light similar to the Light, except that it lights up in neon\nwhen powered, and it emits light in a specific direction.\n\nThe length of the SpotLight will control the brightness, while the width controls the\nangle of the light. Painting the SpotLight will change the light color.\n\nUses: Lighting\n\nRequires: Copper, Glass, Iron\n\nMalleability: Fair\n\nPower Usage: 1.25 energy/second at maximum brightness\n","speedwalk":"PART: SPEEDWALK\nWhile powered, SpeedWalks increase the movement speed of any player walking upon them.\n\nUses: Player Transport\n\nRequires: Aluminium, Titanium, Amethyst, Oil\nMalleability: Excellent\n\nPower Usage: 1.2 energy/second\n","protalium":"PART: PROTALIUM\n\nProtalium is a rare, glowing crystal only found on other planets. It is the rarest\nnatural resource in the game.\n\nProtalium emits more light as more are connected to each other, and can be used as an\ninfinite light source.\n\nUses: Lighting, Currency, Manufacturing\nObtained: Protalium Ore, found on some planets\nMalleability: none\n","signalswitch":"PART: SIGNALSWITCH\n\nA SignalSwitch controls the flow of signals. Clicking on it or activating Polysilicon\nturns it on or off.\n\nIn models, SignalSwitches are loaded inactive if their color is set to “Really black”.\nUses: Indicators, Control\n\nRequires: Silicon\nMalleability: Poor\n","sign":"PART: SIGN\n\nA Sign displays text written by the Hammer's Config Tool.\n\nTo make a Sign display a decal, enter “id:[decalid]\". Example: id:235235235\nUses: Labels, Billboards\n\nRequires: Copper, Charcoal\nMalleability: Good\n","sensor":"PART: SENSOR\n\nSensors are able to gather information about objects in front of them using an invisible ray.\nWhen signaled, they will output data through Mode 3 Polysilicon. The range is determined by\nthe Sensor's length, to a maximum of 1600 studs.\n\nThe mode of Sensors can be adjusted with the Hammer's Config Tool.\n\nSensor Modes:\n\n1: Outputs the name of the object.\n\n2: Outputs the position of where the ray hit.\n\n3: Outputs the color of the object.\n\n4: Outputs the distance between the Sensor and detected object.\n\n5: If the object is signalable, transfers the signal to it. Outputs 1 if successful, 0 if not.\n6. Outputs the player who last edited the object.\n\nUses: Circuits, Rangefinder, Robots\nRequires: Glass, Aluminium, Silicon, Copper\nMalleability: Poor\n","oil":"SUBSTANCE: OIL\nOil is a slippery liquid used chiefly as fuel for Engines, Turbofans, Turboshafts, and Rockets.\nWhen launched by a Catapult, Oil is set on fire.\n\nAs a liquid substance, Oil evaporates unless kept in a Container, and can be transferred\nthrough Pipes, Controllers, Valves, Fuel Cans, and Faucets.\n\nUses: Fuel, Weapon\nObtained: Derrick drilling, small amounts from using Harvest on large rock formations\nMalleability: none\n","defender":"PART: DEFENDER\n\nA Defender is a mechanical device that automatically hurls sharp projectiles at enemy players.\n\nAfter being placed, the Defender will take 60 seconds to recharge. During this time,\nlock the Defender and click on it (the menu will only open for the player who locked it)\nand enter a list of players for the Defender to attack, seperated by spaces.\nAlternatively, you can paint a Defender to your team color to automatically attack\nenemy team members. Defenders will despawn if placed underwater.\n\nWhen fully charged, the Defender launches projectiles that instantly kill enemies on\nfoot within 400 studs, but are useless against land or sea vehicles. They can also kill\nplayers piloting aircraft that have landed nearby, or flying low. Defenders cannot be\nplaced within 500 studs of each other, or the one that becomes active first will delete\nthe other. Defenders can be broken by the Fist except in team events. They also have\n40x more health in team events, and cannot be moved when recently damaged.\n\nlf a Defender is broken off (no longer connected to anything) while active, or health is\ndepleted, it will burst into flames and be destroyed.\n\nDefenders function as team spawnpoints in team events, but must have an open area around it\nand be completely uncovered (they will not corrode), or they will slowly take damage.\n\nUses: Anti-Personnel Defense, Anti-Warhead, Team Spawn\nRequires: Quartz, Wood, Charcoal, Flint\nMalleability: none\n","uranium":"PART: URANIUM\nUranium is a yellow-green metal that constantly emits radiation.\n\nIn large amounts, Uranium is dangerous to handle because of radioactivity.\nWearing a RadiationSuit is recommended.\n\nUses: Manufacturing, Defense\nObtained: Subsoil (Derrick)\nMalleability: none\n","amethyst":"PART: AMETHYST\n\nAmethyst is a valuable gem found only by harvesting crystal outcroppings. It has uses similar\nto Ruby, being relatively weaker but more malleable.\n\nUses: Manufacturing, Currency, Windows\nObtained: Crystal Mining\nMalleability: Fair\n","seat":"PART: SEAT\n\nA Seat allows you to attach your character to an object. This is useful for chairs\nand most vehicles.\n\nUses: Chairs, Vehicles\nRequires: Wood\nMalleability: none\n","seaalloy":"PART: SEAALLOY\n\nSeaAlloy is an alloy of Aluminium resistant to acid and BallastTank corrosion, making it\nsuitable for use in submarines.\n\nThe physical properties of SeaAlloy are close to that of Aluminium, though SeaAlloy is\nflammable, more expensive, and somewhat more malleable.\n\nLike all parts, SeaAlloy will still dissolve if left in the ocean without a BallastTank.\nUses: Submarines, Large Structures\n\nRequires: Aluminium, Magnesium, Copper\nMalleability: Good\n","scanner":"PART: SCANNER\nThe Scanner gives information on nearby objects.\n\nAfter powering, pressing the Search button will draw rays toward areas where there are\na large amount of parts at least 250 studs away. Use this to easily find vehicles and\nbases. To find smaller amounts of parts, you may need to re-search multiple times.\n\nPressing the Scan button shows information about the nearest enemy craft. The Scanner\nwill find out which players are aboard the vehicle, what weapons it carries, and display\ncertain special abilities. This ability works best when used on enemy spaceships.\n\nUses: Combat Info, Enemy Detection\n\nRequires: lron, Copper, Silicon, Eridanium, Ruby\nMalleability: none\n\nPower Usage: 26.6 energy/second while scanning\n","bank":"PART: BANK\n\nBanks are credit storage boxes which, unlike a player's credit inventory, save the contents\nacross servers. Each can hold up to 10000 credits.\n\nLeft-clicking on a Bank will deposit 100 credits for the player who locked it, or 25 Credits\nfor any other player. Right-clicking withdraws 100 credits for the player who locked it.\n\nSignal a Bank through Mode 0 Polysilicon to eject a money bag of the amount signaled. Note that\nthe Polysilicon must be locked by the same player who locked the Bank.\n\nSignal a Bank directly to output the credit amount through Mode 3 Polysilicon.\n\nA PayBox connected to a Bank acts as a deposit detector and outputs a signal if a player inserts\na set amount of credits, which will go into the Bank.\n\nA Computer connected to a Bank or Modem can wirelessly receive credits from other Computer-conr\nBanks using the Credit instruction. The sending Bank must be locked by the same player as the Con\nSee the \"Programming\" page for more details.\n\nUses: Credits Storage, Credit Dispensing/Collecting\nRequires: Iron, Titanium, Aluminium, Magnesium\nMalleability: none\n","saving":"SYSTEM: SAVING\n\nLevels in Scarlet Skies will save themselves across servers for up to 165 hours\nof gameplay per level.\n\nA server auto-saves every 2 minutes under these conditions:\n-Server lifetime is not more than 165 hours (Game years: 2000).\n-There are at least three players in the server.\n\n-There are no more than 3000 savable parts in the server.\n","diamond":"PART: DIAMOND\nDiamonds are small, transparent gems acquired from Diamond Ore.\n\nThey are among the strongest materials on Earth, but their small size limits their\nuse for building. They can be arranged in a grid pattern for diamond-studded armor.\n\nUses: Manufacturing, Diamond-Studded Armor\nObtained: Diamond Ore Mines\nMalleability: none\n","sand":"PART: SAND\n\nSand is a pile of sand. Usually it is yellow, but different colors of Sand can be found\non other planets.\n\nThe only practical use for Sand is to make Glass (by burning it), or Goo.\nUses: Manufacturing\n\nObtained: Beaches, Sand Planets\nMalleability: none\n","ruby":"PART: RUBY\n\nA Ruby is a very strong gem that can be obtained from stone mining. When stone is mined,\nthere is a very small chance for a Ruby to be uncovered.\n\nBecause it is slightly malleable, it can be used to make strong windows.\nUses: Manufacturing, Currency, Windows\n\nObtained: Stone Mining\nMalleability: Poor\n","rubber":"PART: RUBBER\n\nRubber is a high-friction, bouncy part. It loses bounciness when made into wheels.\nRubber causes no fall damage when landed on, making it useful in many situations.\nUses: Manufacturing, Landing Gear\n\nRequires: Leaves, Stone\nMalleability: Excellent\n","rotor":"PART: ROTOR\n\nA Rotor hovers itself and anything attached at varying altitudes when spun, to be used in\nhelicopters.\n\nThe most common method for using a Rotor is attaching horizontally to an Engine or Motor.\nMake sure the hinge on the Rotor is facing upwards, not downwards into the attached motor.\n\nRotors hover at an altitude depending on their spinning speed. Additionally, tilting the Rotor\nwill move it laterally in the direction it is tilted, enabling forward/backward control on\nhelicopters by tilting the aircraft in the direction desired. There is less lift at higher altitudes,\nand at steeper tilt angles. A tilt angle that is too steep can lead to stalling.\n\nWhile having some disadvantages (such as lower maximum height, being louder, and less lift)\ncompared to an airplane, Rotor helicopters can hover in one place, are less easy to stall, and more\nmaneuverable. Rotors are also moderately resistant to Flak explosions.\n\nRotors cannot be effectively driven by DriveBoxes, so attach directly to an engine.\nUses: Helicopters\n\nRequires: Aluminium, Iron, Charcoal, Ruby\nMalleability: none\n","storms":"SYSTEM: STORMS\n\nRainstorms will happen occasionally on Earth. During a rainstorm, rain is seen, the clouds\nturn dark grey, and lightning will strike in places.\n\nA player out in the rain, even with a Coat or a PolyesterCoat will get very cold. Get indoors\nor near a powerful heater when it is raining.\n\nIn addition to making players colder, rainstorms can also corrode most types of parts that\nare left outdoors. To protect these parts, you will need to put coverings on them that are\nresistant to rain.\n\nParts resistant to weather: Ceramic, BaseCenter, Lexan, TintedGlass, Pipe, Asphalt, Stone,\n\nBrick, Arcolantium, SolarPanel, ForceField, Sail, Leaves, Ruby, Diamond, Glass, Quartz, Balloon,\nCannon, DimensionalDoor, Gold, Wing, Aluminium, Titanium, Eridanium, Abantium, Protalium, Sign,\nPropeller, LightningRod, ZapWire, Wire, Light, Rotor, Gun, Plants, Track, Bend, MechLimb,\nAccelerator, Windmill, SeaAlloy, BioWall, Horse, Goo, Concrete, Hull, CrudeHull, SpeedWalk, Y,\n\nLamp.\n","remoteseat":"PART: REMOTESEAT\n\nA RemoteSeat is similar to a SteeringSeat, but can only be controlled wirelessly by other\nSteeringSeats. It cannot be used as a seat to sit in.\n\nUse the Hammer's Adjust tool to set the RemotelD of both the RemoteSeat and the SteeringSeat\nto the same number. For remote control to work, the steering mode of both parts must\n\nnot be 0. The RemoteSeat will rotate itself based on its own mode, meaning you can use\narrowkey control on your SteeringSeat while mouse-controlling a RemoteSeat, or vice versa.\nTurnSpeed on the RemoteSeat does nothing.\n\nUses: Remote Control\nRequires: Wood, Gold, Silicon, Copper\nMalleability: none\n","coat":"PART: COAT\n\nA Coat is the lowest tier of wearable objects. Put it on by touching it with\nyour character.\n\nA Coat will provide extra warmth in all situations, usually a good thing but will also\ncause you to overheat faster, especially near sea level. Coats can also be painted\nbefore wearing them.\n\nUses: Temperature control\nRequires: Wood, Oil\nMalleability: none\n","ceramic":"PART: CERAMIC\n\nCeramic is a very hard but brittle material. It is resistant to Acid, weathering, lasers,\nand most other forms of damage, but can break apart from shock similiar to Foam. It will\nnot break from impacts of parts with the same player who owns the Ceramic.\n\nCeramic is also used in re-entry shielding for spacecraft, as it absorbs heat and does not\nburn up in the atmosphere.\n\nUses: Armor, Construction, Re-Entry Shielding\nRequires: Quartz, Jade, Stone, LiquidNitrogen\nMalleability: Fair\n","crudehull":"PART: CrudeHull\nCrudeHulls float on the ocean, enabling watercraft to be built on them.\n\nNOTE: Any watercraft must have all hulls connected to each other (not seperated by other\nparts), failure to do so may cause the watercraft to flip.\n\nAny hulls will crack when damaged enough to be breached, and begin to take on water. Using\na BilgePump will pump water out from all hulls on the watercraft at once, and the\nWrench tool may be used to repair them. They are very weak on land.\n\nIf a hull is removed/destroyed, hulls that were connected to it will be severely damaged.\nUses: Rafts, Ships, Seaplanes, Amphibious Vehicles\n\nRequires: Wood\nMalleability: Extreme\n","glass":"PART: GLASS\nGlass is a weak, transparent part that is easily shattered.\nIt is obtained by setting Sand on fire.\nUses: Windows\n\nObtained: Burning Sand\nMalleability: Good\n","ramjet":"PART: RAMJET\n\nRamjets produce thrust similar to Turbofans, but do not function at low speeds or altitudes and\nuse much more fuel. However, they are significantly faster. They cannot generate electricity with\na Collector.\n\nThe front of a Ramjet must be uncovered for it to function.\nUses: Vehicles\n\nRequires: Aluminium, lron, Jade\nMalleability: none\n","gas":"SUBSTANCE: GAS\n\nGas is a flammable gas used as fuel for Engines, FlameThrowers, Turbofans, and Turboshafts. When\nused as Engine fuel, it is superior to Oil in both efficiency and top speed.\n\nAs a gaseous substance, Gas evaporates unless kept in a Container, and can be transferred\nthrough Pipes, Controllers, Valves, Fuel Cans, and Faucets.\n\nUses: Fuel, Weapon\nObtained: Offshore Derrick drilling\nMalleability: none\n","silicon":"PART: SILICON\nSilicon is a green substance used mainly in making electronics.\nUses: Manufacturing\n\nObtained: Subsoil (Derrick)\nMalleability: Poor\n","powerplant":"PART: POWERPLANT\n\nPowerPlants are large Coal-powered engines.\n\nPowerPlants are the most powerful motor type, turning faster with much higher amounts of\ntorque than a regular Engine, while also being relatively quiet. However, their sheer size\n\nand weight makes them impractical for many applications. They spawn at full power by default.\n\nInserting Lirvanite into a PowerPlant grants a massive speed and torque increase.\n\nLinking with a RodConstraint to a DriveBox creates a driveshaft that can turn the\nDriveBox's hinge.\n\nUses: Vehicles, Power Generation\nRequires: Titanium, Iron, Aluminium, Oil\nMalleability: none\n","powercell":"PART: POWERCELL\n\nPowerCells are the base of many electrical systems. They can be charged by several items,\nand will transfer energy through Wires to be used for any connected loads, such as\nLights or Heaters.\n\nA PowerCell can be resized to change the amount of energy stored.\n\nWhen a PowerCell is completely discharged, it cannot be recharged again for 12 seconds.\nUses: Power Storage, Circuits\n\nRequires: Sulfur, Copper, Iron, Ashes\n\nMalleability: Fair\nPower Capacity: Size x 12.5\n","plutonium":"PART: PLUTONIUM\nPlutonium is a highly unstable radioactive element.\n\nWhen Plutonium is placed near neutron-reflecting materials (metallic parts, including other\npieces of Plutonium), an atomic chain reaction may begin to take place, charging electrically\nconnected PowerCells and releasing a hazardous neutron burst. If the reaction energy goes too\nhigh, the Plutonium will go supercritical and blow itself apart after a few moments.\n\nSupercritical Plutonium attached to a Warhead will amplify the Warhead's destructive potential\nif it is detonated before the Plutonium itself explodes.\n\nSignaling Plutonium will output its energy level to Mode 3 Polysilicon on a scale of 0 to 100,\nwith 100 being supercritical. Note that ionizing rays from Plutonium will randomly signal\nunprotected signalable parts, so any measurement device must be made to resist this effect.\n\nUses: Nuclear Weapons, Power Generation, Randomizers, Nub Repellent, Troll Attractant\nObtained: Inserting EnrichedUranium into a full, steaming Reactor\nMalleability: none\n","herbicide":"PART: HERBICIDE\nHerbicide is a special bomb used to destroy Plants.\n\nWhen signaled, it releases a large gas burst that is harmless to players, but eliminates\nall Plants within a 200-stud radius. Generated Cotton Plants are not affected.\n\nThe range is reduced when used against plants with the Tough trait.\nUses: Plant Removal\n\nRequires: lron, Sulfur, Oil, Ashes\nMalleability: Fair\n","jade":"PART: JADE\nJade is a valuable green gem that cannot be duplicated.\nUses: Currency, Manufacturing\n\nObtained: Jade Ore Mines\nMalleability: Poor\n","pitchfork":"TOOL: PITCHFORK\nA Pitchfork can be used to hurl small objects.\n\nWhen attacking alone, Pitchforks are generally weak as a weapon. However, if multiple\nplayers are using Pitchforks to attack as a group, they gain a significant damage bonus,\nas well as the ability to break certain parts. The Pitchfork's throwing ability can also\n\nbe used to launch flaming debris or bombs at the enemy.\n\nUses: Weapon, Moving Parts\nRequires: lron, Wood\n\nRange: Melee\n\nDamage: Low, higher in group\nFiring Rate: Medium\n","paybox":"PART: PAYBOX\n\nWhen clicked, a PayBox transfers credits from the user's inventory to a connected Bank and\nemits a signal of the player's name if the operation is successful. The PayBox will not\nwork if a Bank is not connected.\n\nUse the Hammer's Config Tool to set the amount of credits to accept.\nUses: Credit Entry, Vending Machines\n\nRequires: Iron, Titanium, Aluminium, Magnesium\nMalleability: Poor\n","concrete":"PART: CONCRETE\n\nConcrete is a tough structural material with properties between those of Brick and Iron. It\nis stronger and less malleable than the former, more malleable and more expensive than the\nlatter. Concrete does not corrode in rain.\n\nUses: Construction\nRequires: Quartz, Stone, Sand, Flint, Water, Diamond\nMalleability: Good\n","heatcylinder":"PART: HEATCYLINDER\n\nHeatCylinders push and pull a special rod while connected to a heat source, enabling the\ncreation of custom engines which can have high speed but low torque.\n\nTo link a HeatCylinder, attach a SpringConstraint from the cylinder to the part to be\nacted upon, such as a crank on a shaft. When there is any heat source attached, it will\nreciprocate with a force determined by the total size of the cylinder and the speed\nsetting (set with the Hammer's Adjust tool or by a Controller, reverse does nothing).\nThe HeatCylinder's spring length must be less than 20 studs in total.\n\nHeatCylinder engines are reversible, and must be spun in the desired direction to start.\nCylinders less than 2 studs wide are single-acting (otherwise double-acting).\n\nUses: Hot Air Engines\nRequires: Copper, Glass\nMalleability: Fair\n","memorychip":"PART: MEMORYCHIP\nMemoryChips store data from Computers, signals, or the Hammer's Config Tool.\n\nTo input signal data, signal attached Mode 1 Polysilicon. To output the data stored as\na signal, use Mode 0 Polysilicon.\n\nUses: Data Storage\nRequires: Silicon, Copper\nMalleability: Poor\n","drivebox":"PART: DRIVEBOX\n\nA DriveBox enables a SteamEngine, Engine, or Motor to apply torque to multiple\n\nparts from a distance. Use the Hammer's Link tool to link a RodConstraint between\nthe DriveBox and the engine. If there are too many DriveBoxes attached, the engine\nwill stall and shut down. DriveBoxes have much lower torque than directly connecting.\n\nSignaling Polysilicon connected to a DriveBox will activate or deactivate it.\nThe DriveBox can be reversed with the Hammer's Config Tool.\nUses: Vehicles, Aircraft, Seacraft\n\nRequires: Iron, Oil\nMalleability: Fair\n","market":"PART: MARKET\n\nThe Market is a node to a global marketplace for Trinkets, special items that are not obtained\nin regular ways. New Trinkets will be up for sale on the front list periodically,\n\nand may change the amount in stock or prices. To buy a Trinket, click on one in the list\n\nto select it and click on the Market itself to buy.\n\nTeal = Common\n\nYellow = Uncommon\n\nRed = Rare\n\nPurple = Legendary\n\nGreen = Selected\n\nInsert Trinkets to sell them on the Market. A profit can be made if the price is higher\nthan it was when they were bought.\n\nUses: Unusual Item Obtaining, Profit\nRequires: Stone, Glass, Wood, Gold\nMalleability: none\n","lightningrod":"PART: LIGHTNINGROD\n\nThe LightningRod is a part that gives complete protection against lightning strikes\nwithin a certain radius. It will also charge a PowerCell wired to it.\n\nThe radius of protection is the rod's height x 3, maximum of 600.\n\nUses: Lightning Protection\n\nRequires: Copper, Gold, Abantium\nMalleability: Excellent\n\nPower Generation: 3000 power per strike\n","zapwire":"PART: ZAPWIRE\n\nZapWires are electrical wires that have several effects on parts that touch it while powered.\nThese are:\n\n-Sets fire to flammable parts.\n\n-Chars and does damage to players.\n\n-Momentarily transmits energy to electronic parts.\n\n-Transmits signals to signalable parts.\n\nIt glows when powered, giving it a use to make neon signs, but also a disadvantage in that\nit will attract attention to a base defended by a ZapWire fence. ZapWires will also glow\nwhen signaled, but will not cause any damage.\n\nBecause it can set fire to parts, it can be used as an efficient firestarter.\n\nUses: Defense, Weapons, Firestarter, Neon Signs\nRequires: Copper, Titanium\n\nMalleability: Excellent\n\nPower Usage: 1 energy/second\n","dimensionaldoor":"PART: DIMENSIONALDOOR\n\nThe DimensionalDoor is a part that leads to a seperate dimension. It can be used to\ncreate containers or machines that have a much larger interior than their exterior.\n\nIt is also useful for machines that move at a high speed: anything inside the\nDimensionalDoor is not affected by the DimensionalDoor's movement.\n\nUses: Dimensionally Transcendental Objects\nRequires: Protalium, Lirvanite, Titanium\nMalleability: none\n","keyboard":"PART: KEYBOARD\n\nKeyboards are connected to Computers to interface with them, and can also send signals on\ntheir own to connected parts.\n\nEntering data in the program editor window will create the same data in the lower window\nbut with indents converted to slashes; the reverse happens when entering data in the lower\nwindow.\n\nBUTTONS\n\n-Run/Enter: Runs the entered program, or enters data into Channel 10.\n\n-Stop: Stops the running program.\n\n-Open/Save: If no text was entered, opens the data on the hard disk into the window.\nOtherwise, saves the text to the disk. Disk data saves across servers.\n\n-Dial/Search: If no text was entered, displays a list of all available website servers.\nOtherwise, dials the server address that was entered.\n\n-Edit: Toggles the program editor window.\n\n-MP: Toggles the mousepad (only used for programs that require it).\n\n-Exit: Closes the window.\n\nUses: Computer Input, Signal Input\nRequires: Ice, Ashes, Oil, Copper\nMalleability: none\n","interceptor":"PART: INTERCEPTOR\n\nAn Interceptor is an extremely fast self-contained rocket weapon designed to eliminate\nimpending Warhead attacks.\n\nWhen signaled, the Interceptor will search for Warheads in motion, launch if a target is\npresent, and aim for it on a ballistic trajectory. It will detonate when in range as an\n\nair burst, eliminating the Warhead even through armor and destroying or severely damaging\nthe vehicle carrying it. Interceptors should normally be launched pointing upwards.\n\nAlternatively, by signaling the Interceptor with position data (X;Y;Z), it will launch\n\nand target the specified point as a medium-range missile, though this is better used in a\npinch due to the sheer cost-to-yield. Maximum range is limited to 4000 studs while in\nthis mode.\n\nUnlike other parts, a Camera attached to an Interceptor will neither disconnect during\nlaunch nor interfere with the missile's operation.\n\nUses: Anti-Nuclear Defense, Ground-Attack Missile\nRequires: Titanium, Charcoal, Sulfur, Oil, Aluminium, Silicon, Diamond\nMalleability: none\n","inertiatrigger":"PART: INERTIATRIGGER\n\nAn InertiaTrigger is a sensing device that will signal connected parts if it experiences\n\na change in velocity greater than or equal to its threshold setting. Use the Hammer's\nConfig tool to change the threshold as well as the mode, which can be set to only signal\non accelerations, only signal on decelerations, or signal on both.\n\nThe signal outputted is the acceleration in studs per second.\nUses: Electronics, Detonators\n\nRequires: Iron, Oil\nMalleability: none\n","musket":"TOOL: MUSKET\n\nThe Musket fires a bullet that can do high damage to players.\n\nMusket Ammunitions (load an ammo by using the Ammo button in Produce GUI):\n\n-Default: Long-range bullet with high damage.\n\n-Goo: Jamming bullet that disables enemy ranged weapons for 22 seconds, but less damage.\n-Acid: Weakening bullet that doubles damage dealt to enemy for 22 seconds, but less damage.\nUses: Weapon\n\nRequires: Iron, Flint, Wood, Gunpowder\nRange: Medium\n\nDamage: High\nFiring Rate: Slow\n","flint":"PART: FLINT\n\nFlint has a small chance to set fire to parts that are rubbed against it. It can be\nused as a crude firestarter, or a crude weapon to use against flammable objects.\nWhen mining for Stone, there is a chance to get Flint as well as the Stone.\n\nUses: Crude Firestarters, Crude Weapons\nObtained: Stone Mining\nMalleability: Poor\n","automaton":"OBJECT: BOT\nBots are NPC humanoids which can be created or encountered throughout the game.\nCLASSES\n\n-Automaton: Non-respawnable robot which can be created by players. Automatons follow all\norder from their creator (or anyone else with control) without question, but possess very\nlittle independence or individuality.\n\n(Requires: Iron, Silicon, Gold, Computer, Actuator)\n\n-Rogue: Rogues are technologically advanced, having left Earth centuries ago, and can be\nseen on planets or in outer space. They are the guardians of Relics and are hostile to all\nplayers and Bots.\n\nABILITIES\n\nAutomatons are humanoid robots that can be created and given orders. They will obey the\norders given to them by their creator (or at least the first person they see when created).\n\nLIST OF AUTOMATON ORDERS\nEach order must be given in chat, along with the Automaton's name in the sentence (or use\n“all\" to speak to all Automatons under your control).\n\n-Roam: Stop following the player, and wander away at will.\n\n-Come: Follow the player.\n\n-Hate [name]: Attack the named player/bot whenever in sight.\n\n-Forgive [name]: Do not attack the named player/bot in sight anymore.\n-Follow [name]: Follow the named player/bot.\n\n-Stop: Halt the current action.\n\n-Sit: Sit in the nearest regular seat, as a passenger.\n\n-Get Out: Get out of a vehicle or seat.\n\n-Grab [part]: Pick up the nearest unlocked [part].\n\n-Drop: Drops current part.\n","refinery":"PART: REFINERY\n\nA Refinery turns ores into valuable materials. Refineries will slowly process any ore\nattached to them, but if powered, can almost instantly process ores inserted into it.\n\nUses: Ore Refining\nRequires: lron, Copper, Gold, Sulfur, Ruby, Ice\nMalleability: none\n","bend":"PART: BEND\n\nA Bend is a wedge-shaped Track used to create a bend or switch in the rails. To use,\nplace between at least two tracks, aligned to the rails. If the Bend is not the last\ncomponent to be placed, wait 60 seconds before use for it to attach itself to the rails.\n\nRailroad switches can also be created using Bends by arranging the Tracks onto\ndifferent sides (including straight through, which is not connected to the Bend at\nthe front). To switch a railroad switch, it must be signaled.\n\nA 90 degree turn is possible using two standard Bends.\nUses: Trains, Rollercoasters, Elevators\n\nRequires: Wood, Iron, Stone\nMalleability: Fair\n","generator":"PART: GENERATOR\n\nGenerators collect energy from running Engines, SteamEngines, Turbofans, Turboshafts,\nPowerPlants, and pedal SteeringSeats that are attached.\n\nThey can also generate power from an attached piece of Uranium. The energy output is far\nlower than a standard Reactor and can expose the user to radiation, but lasts indefinitely.\n\nNOTE: Non-Uranium Generators will slowly overheat and catch fire if left running in the\nsame area for too long. A ticking noise will be heard when overheating is imminent, and the\ntemperature can be seen by the color of the part itself.\n\nUses: Power Generation\nRequires: lron, Copper, Gold, Quartz\nMalleability: none\n","geigercounter":"PART: GEIGERCOUNTER\n\nA GeigerCounter is a device used to measure the level of radiation in an area.\n\nWhen active, the GeigerCounter will click every time an ionizing particle is detected.\nUses: Radiation Detection\n\nRequires: lron, Gold, Aluminium\nMalleability: none\n","gyro":"PART: GYRO\n\nA Gyro turns itself to keep upright when powered. It is useful for some aircraft, and\nretrieving land vehicles that have tipped over.\n\nGyros can also be signaled to turn them on or off.\n\nUses: Machines, Aircraft\nRequires: Oil, lron\n\nMalleability: Poor\n\nPower Usage: 0.33 energy/second\n","valve":"PART: VALVE\n\nA Valve controls the flow of Container substances through it. Clicking on it or activating\nattached Polysilicon will turn it on or off.\n\nIn models, Valves are loaded inactive if their color is set to “Really black”.\nUses: Indicators, Control\n\nRequires: lron\nMalleability: Poor\n","faucet":"PART: FAUCET\n\nA Faucet releases liquids or gases from Containers. They cannot release solids, such as\nCoal and Ammo.\n\nMaking the Faucet longer increases the force the substance is shot out.\nUses: Liquid Dispensing, Fire Hose\n\nRequires: lron\nMalleability: Fair\n","energyshield":"PART: ENERGYSHIELD\nThe EnergyShield creates a protective field around whatever it is connected to when powered.\n\nEnergyShields absorb almost all incoming weapon projectiles, as well as any kind of\nexplosion (besides nuclear). Each time the shield is hit, a certain amount of energy\ndepending on the type of weapon is drained. Small shields can also keep out water.\n\nThe EnergyShield is modified with the Hammer's Config Tool to give different balances of\nabilities. Each number in the 3-digit code corresponds to an ability, and all 3 numbers\nmust add up to 9 for the shield to function.\n\nABILITIES:\n\nAbility 1: Health. Modifies basic shield health from 100 to 1000.\n\nAbility 2: Regeneration. Higher values will regenerate shield health during battle faster\n\n(up to a maximum rate of 2/second), and also provide much faster non-battle regeneration.\nAbility 3: Deflect. Higher values cause the shield to have a higher chance to reflect a\nprojectile and use it against the enemy, while also blocking the damage.\n\nThe shield will automatically size to protect any moving machine, but will default to a\n100-stud radius if connected to ground. Higher shield radius uses more energy. Shields cannot\nactivate inside each other, and a depleted shield will deplete nearby unpowered EnergyShields.\n\nUses: Defense\n\nRequires: Abantium, Eridanium, Diamond, Ruby, Jade\n\nMalleability: none\n\nPower Usage: 16.6 energy/second minimum, increases with radius (28.2/s for 100 studs)\n","mechlimb":"PART: MECHLIMB\n\nWhen active, MechLimbs attempt to “grab” or point towards a position received by a signal\n(in the form of X;Y;Z).\n\nMechLimbs come in a long box when first spawned, and must be clicked to unpack (or unpacks\nautomatically when loaded in a model) into the four different segments, connected by\n\na shoulder/hip joint, an elbow/knee joint, and a wrist/ankle joint. The end segment is\n\nshortest, and will appear where the decal on the MechLimb package is. Any connected parts\nwill remain connected to the respective segment. MechLimbs do not save on the server.\n\nMechLimbs will ONLY unpack if the length is a multiple of 3 (plus two), between 8 and 152.\nExamples: 8, 11, 14, 17, 20, 23, 26, 29, 32, 35, 38, 41, 44, 47, 50...\n\nTo use, power the first segment, and send signals to it directly or through Polysilicon.\n\nThe pose will be held even if the MechLimb is moved or unpowered.\n\nDespite appearances, MechLimbs will continue to operate if either of the mid-segments are\ndestroyed.\n\nDirect signal: Moves limb towards position.\n\nMode 0 Polysilicon: Moves limb towards position relative to shoulder/hip joint.\nMode 1 Polysilicon: Points end segment towards position.\n\nMode 2 Polysilicon: Points end segment towards position relative to itself.\n\nSending only one entry with any of these will set the movement speed (0-20, default 20).\n\nUses: Robotic Arms, Spider Legs, Turrets, Inchworms, Tentacles, Anthro Experience\nRequires: Titanium, Copper, Iron, Silicon, Quartz\n\nMalleability: Good\n\nPower Usage: 30/second\n","relic":"PARTS: RELICS\n\nRelics are exceedingly rare parts with powerful abilities. There cannot be more than one of\nthe same Relic at any given time.\n\nConnect all seven Relics together and click the Orb to reveal the final secret of Scarlet Skies.\nUses: 7???\n\nObtained: ???\nMalleability: none\n","organicmatter":"PART: ORGANICMATTER\n\nOrganicMatter is a byproduct organic material produced by the BioLab. Plants can grow on\nit, and is used for manufacturing a few other items.\n\nUses: Construction, Manufacturing\nObtained: Inserting Leaves or Wood into a BioLab, Nexus Plant Vines\nMalleability: Good\n","combolock":"PART: COMBOLOCK\n\nThe ComboLock will signal parts connected to it only if the correct password is dialed.\nIf directly connected to a DoorTemplate, the DoorTemplate will be un-openable except by\nthe ComboLock.\n\nAdjust the password with the Hammer's Config Tool.\nUses: Password Locking\n\nRequires: Titanium, Copper, Silicon\nMalleability: none\n"}